{
"intents": [
    {
        "tag": "Saludo",
        "patterns": ["Hola", "que tal","Que haces","como estas"],
        "responses": [
            "¡Hola! Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
            "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia de género. ¿Cómo puedo asistirte?"
        ]
    },

    {
        "tag": "buenosDias",
        "patterns": ["Buenos días"],
        "responses": [
            "Buenos dias, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
            "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
            "Buenos días. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
        ]
    },
    {
        "tag": "buenasTardes",
        "patterns": ["Buenos tardes"],
        "responses": [
            "Buenas tardes, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
            "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
            "Buenas tardes. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
        ]
    },
    {
        "tag": "buenasNoches",
        "patterns": ["Buenas noches"],
        "responses": [
            "Buenos Noches, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
            "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
            "Buenos Noches. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
        ]
    },
    {
        "tag": "Despedida",
        "patterns": ["Adiós", "Hasta luego",	"chao"],
        "responses": [
            "De nada, si tienes más preguntas en el futuro, no dudes en preguntar. ¡Cuídate!",
            "Hasta luego. Siempre estoy aquí si necesitas más información o apoyo.",
            "No hay problema, estoy disponible para ayudarte en cualquier momento. ¡Adiós!"
        ]
    },
    {
        "tag": "Agradecimiento",
        "patterns": ["Gracias por la ayuda", "Te agradezco", "Estoy agradecido","Gracias"],
        "responses": [
            "No hay de qué, siempre estoy aquí para ayudar. Si tienes más preguntas, no dudes en preguntar.",
            "De nada, es un placer ayudarte. No dudes en contactarme si necesitas más información.",
            "¡Gracias por tu agradecimiento! Estoy disponible para responder tus preguntas en cualquier momento."
        ]
    },
    {
        "tag": "No_entendido",
        "patterns": ["No entiendo", "No sé qué hacer", "Confundido"],
        "responses": [
            "Entiendo que puedas sentirte confundido. Estoy aquí para proporcionarte información relacionado con violencia basada en género. ¿En qué puedo aclararte las dudas?",
            "No te preocupes si no entiendes algo. Estoy aquí para ayudarte a obtener la información relacionado con violencia basada en género que necesitas.",
            "Si te sientes confundido, no dudes en preguntar más. Estoy aquí para aclarar tus dudas."
        ]
    },
    {
        "tag": "Informativo",
        "patterns": ["Cuéntame más", "Más información", "Explícame"],
        "responses": [
            "Claro, puedo proporcionarte información sobre la violencia basada en género, sus tipos y cómo buscar ayuda. ¿En qué tema específico estás interesado?",
            "Estoy aquí para proporcionarte información detallada sobre la violencia basada en género. ¿Sobre qué aspecto te gustaría saber más?",
            "¡Claro! Si deseas más información sobre la violencia basada en género, no dudes en preguntar. Estoy aquí para ayudarte."
        ]
    },
    
    {
        "tag": "QueEsSexo",
        "patterns": ["Qué es sexo","Explicar sexo","Explicación de sexo","Descripción de sexo","Describir sexo","Significado de sexo","Concepto de sexo","Expresión de sexo","sexo"],
        "responses": [
            "El sexo es la combinación de características biológicas que distingue a los seres humanos como masculinos o femeninos.",
            "El sexo se refiere a las diferencias físicas y fisiológicas entre hombres y mujeres, como los genitales y las características sexuales secundarias.",
            "El sexo se refiere a las características físicas y biológicas que distinguen a hombres y mujeres."
        ]
    },
    {
        "tag": "AspectosBiológicosQueDiferencianSeresHumanosEnTérminosDeSexo",
        "patterns": ["Qué características biológicas distinguen a los seres humanos en cuanto a sexo","Cuáles son las particularidades biológicas que separan a los seres humanos en lo que respecta al sexo","Cuáles son las diferencias biológicas que existen entre los seres humanos en términos de sexo","Cuáles son los rasgos biológicos que identifican a los seres humanos en lo que respecta al sexo","Cuáles son los elementos biológicos que establecen las diferencias entre los seres humanos en cuanto a sexo"],
        "responses": [
            "Los aspectos biológicos del sexo humano incluyen genitales (masculinos o femeninos), cromosomas sexuales (XX para mujeres, XY para hombres) y hormonas (testosterona en hombres, estrógeno en mujeres).",
            "La diferenciación biológica se basa en genitales, cromosomas sexuales y hormonas, determinando a los individuos como hombres o mujeres.",
            "Características sexuales primarias (genitales), cromosomas sexuales (XX o XY) y hormonas (testosterona o estrógeno) son factores biológicos que diferencian a los seres humanos en términos de sexo."
        ]
    },
    
    
    {
        "tag": "DiferenciaEntreSexoYGenero",
        "patterns": ["diferencia entre sexo y género", "distinción entre sexo y género","distingue sexo y género","Es lo mismo sexo y género","sexo y género"],
        "responses": [
            "Sexo se refiere a las características biológicas, como genitales y cromosomas, que clasifican a una persona como hombre o mujer. Género se relaciona con las identidades, roles y expresiones sociales y personales asociadas a la feminidad y la masculinidad.",
            "Sexo es biológico y se asigna al nacer, mientras que género es una construcción social y personal que puede variar de una cultura a otra.",
            "El sexo se refiere a lo que naces (biología) y el género se refiere a quién eres (identidad y expresión)."
        ]
    },
    
    {
        "tag": "TiposDeSexo",
        "patterns": ["tipos de sexo","clase de sexo","Categorias de sexo","Cualidades de sexo"],
        "responses": [
            "Es la clasificación de los seres humanos en machos y hembras basada en características físicas y genéticas"
        ]
    },
    
    {
        "tag": "QueEsElGenero",
        "patterns": ["Qué es género","Explicación de género","Descripción de género","Describir género","Significado de género","Concepto de género","Expresión de género","género"],
        "responses": [
            "El género es la identidad personal de una persona relacionada con su sentido de ser hombre, mujer u otra identidad.",
            "El género se refiere a cómo una persona se identifica en términos de masculino, femenino o cualquier otra identidad de género.",
            "El género es la expresión social de la identidad de una persona en relación con las expectativas culturales de la feminidad y la masculinidad."
        ]
    },
    {
        "tag": "QueEsElGeneroBinario",
        "patterns": ["Qué es género binario","Explicar género binario","Explicación de género binario","Descripción de género binario","Describir género binario","Significado de género binario","Concepto de género binario","Expresión de género binario","género binario"],
        "responses": [
            "Género binario: Masculino y femenino.",
            "Tradicionalmente, se ha considerado que son las únicas dos identidades de género que son femenino y msaculino."
            
        ]
    },
    
    {
        "tag": "DiferenciaEntreGeneroYIdentidadDeGenero",
        "patterns": ["diferencia entre sexo y género", "distinción entre sexo y género","distingue sexo de género","Es lo mismo sexo y género","género y identidad de género"],
        "responses": [
            "Género es las expectativas sociales de ser hombre o mujer y identidad de Género es cómo una persona se identifica.",
            "Diferencia de género se refiere a las normas y roles sociales asociados a ser masculino o femenino, mientras que la identidad de género es la forma en que una persona se siente y se identifica en términos de género."
        ]
    },
    
    {
        "tag": "QueEsEstereotiposDeGenero",
        "patterns": ["Qué es estereotipos de género","Explicación de estereotipos de género","Descripción de estereotipos de género","Describir estereotipos de género","Significado de estereotipos de género","Concepto de estereotipos de género","Expresión de estereotipos de género","estereotipos de Género"],
        "responses": [
            "Los estereotipos de género son imaginarios o expectativas de comportamiento que parten de la comprensión social de las diferencias físicas, biológicas o sexuales entre hombres y mujeres",
            "Los estereotipos de género son creencias preconcebidas sobre cómo se espera que se comporten, piensen y sientan las personas en función de su género."
        ]
    },
    
    {
        "tag": "TiposDeGenero",
        "patterns": ["tipos de género","Tipos de identidad de género","clases de genero","clases tipo de genero de género","clases de género","Categorias de género","Cualidades de género"],
        "responses": [
            "Se refieren a las diferentes identidades de género que van más allá de la dicotomía tradicional hombre/mujer. Algunos ejemplos incluyen: hombre, mujer, transgénero, género no binario, género fluido, genderqueer, agénero, bigénero, tercer género y dos espíritus."
        ]
    },
    {
        "tag": "QuéEsViolenciaDeGénero",
        "patterns": ["qué es la violencia de género","Explicar violencia de género","Explicación de violencia de género","Descripción de violencia de género","Describir violencia de género","Significado de violencia de género","Concepto de violencia de género","Expresión de violencia de género","violencia de género" ],
        "responses": [
            "La violencia de género se refiere a cualquier acto o conducta que causa daño físico, sexual o psicológico a una persona debido a su género.",
            "La Violencia de Género es cualquier maltrato específico hacia alguien debido a su género, usualmente mujeres, involucrando violencia física, sexual o psicológica para ejercer poder y control.",
                   "La violencia de género se define como cualquier acto violento o abusivo que se dirige específicamente contra alguien debido a su género."
       ]
    },
    {
        "tag": "QuéEsViolenciaBasadaEnGénero",
        "patterns": ["qué es la violencia basada en género","Explicación de violencia basada en género","Descripción de violencia basada en género","Describir violencia basada en género","Significado de violencia basada en género","Concepto de violencia basada en género","Expresión de violencia basada en género","violencia basada en género","Explicación de VBG","Descripción de VBG","Describir VBG","Significado de VBG","Concepto de VBG","Expresión de VBG","VBG" ],
        "responses": [
            "Violencia basada en género es cualquier forma de violencia que ocurre debido a las diferencias de género y las normas sociales que perpetúan la desigualdad entre hombres y mujeres.",
            "Violencia basada en género es la violencia que se comete contra alguien debido a su género, afectando a personas de todas las identidades de género, pero que afecta principalmente a mujeres y niñas debido a las estructuras patriarcales.",
                   "Violencia basada en género es cualquier actos de violencia, como física, sexual o emocional, que se perpetúan debido a las normas y expectativas sociales sobre el comportamiento apropiado para cada género."
       ]
    },
    {
        "tag": "DiferenciaViolenciaBasadaEnGéneroYViolenciaDeGenero",
        "patterns": ["diferencia entre violencia basada en género y violencia de género", "distinción entre violencia basada en género y violencia de género","En qué se distingue violencia basada en género y violencia de género","Es lo mismo violencia basada en género y violencia de género","violencia basada en género y violencia de género","Es igual violencia basada en género y violencia de género","Cuál es la diferencia entre vbg y violencia de género", "distinción entre vbg y violencia de género","En qué se distingue vbg y violencia de género","Es lo mismo VBG y violencia de género","VBG y violencia de género","Es igua VBG y violencia de género"],
        "responses": [
            "Violencia de género se enfoca en la violencia que afecta a una persona debido a su género, generalmente mujeres víctimas de violencia por parte de hombres. Violencia basada en género (VBG) es un término más amplio que incluye cualquier violencia que se perpetra debido a las diferencias de género.",
            "La violencia de género se dirige específicamente a las personas debido a su género, mientras que la violencia basada en género incluye la violencia que puede afectar a alguien debido a su identidad de género, orientación sexual u otras características relacionadas con el género.",
               "La violencia de género se centra en la desigualdad de género y la opresión de las mujeres, mientras que la violencia basada en género reconoce que las personas de todos los géneros pueden ser víctimas de violencia relacionada con las normas de género y roles sociales."
       ]
    },

    {
        "tag": "QueEsLaOrientacionSexual",
        "patterns": ["Qué es la orientación sexual","Explicación de orientación sexual","Descripción de orientación sexual","Describir orientación sexual","Significado de orientación sexual","Concepto de orientación sexual","Expresión de orientación sexual","orientacion orientación sexual"],
        "responses": [
            "La orientación sexual se refiere a quiénes sentimos atracción emocional y sexual. Puede ser heterosexual, homosexual, bisexual, o de otras formas.",
            "La orientación sexual es a quiénes nos sentimos atraídos: del mismo sexo, del sexo opuesto, o de ambos sexos. Es una parte fundamental de nuestra identidad.",
            "La orientación sexual es sobre hacia quiénes sentimos atracción: hombres, mujeres, ambos o ninguno. Define nuestras preferencias románticas y sexuales."
        ]
    },
    {
        "tag": "CuantasOrientacionesSexuales",
        "patterns": ["Cuántas orientaciones sexuales existen", "cuantas orientaciones sexuales","tipos orientaciones sexuales", "clases de orientaciones sexuales","Categorias de orientaciones sexuales","Cualidades de orientaciones sexuales" ],
        "responses": [
            "Existen numerosas orientaciones sexuales, incluyendo heterosexualidad, homosexualidad, bisexualidad, pansexualidad y asexualidad, entre otras.",
            "No hay una lista fija de orientaciones sexuales, ya que las experiencias son diversas. Sin embargo, algunas comunes son heterosexual, homosexual y bisexual, pero existen muchas más, como pansexual, asexual y demisexual.",
            "La diversidad en las orientaciones sexuales es amplia y va más allá de las categorías básicas. Además de heterosexual, homosexual y bisexual, hay identidades como pansexual, queer, asexual, entre otras, que reconocen la diversidad de las experiencias humanas."
        ]
    },
    
    {
        "tag": "heterosexualidad",
        "patterns": ["Qué es la heterosexualidad","Explicar heterosexualidad","Explicación de heterosexualidad","Descripción de heterosexualidad","Describir heterosexualidad","Significado de heterosexualidad","Concepto de heterosexualidad","Expresión de heterosexualidad","heterosexualidad","heterosexual"],
        "responses": [
            "Heterosexualidad es la orientación sexual en la que una persona siente atracción romántica y sexual hacia personas del sexo opuesto.",
            "Heterosexualidad es cuando una persona se siente atraída emocional y sexualmente por individuos del género opuesto al suyo.",
            "La heterosexualidad es la orientación sexual común en la cual una persona se siente atraída romántica y sexualmente hacia personas del sexo contrario."
        ]
    },
    {
        "tag": "Homosexualidad",
        "patterns": ["Qué es la Homosexualidad","Explicar Homosexualidad","Explicación de Homosexualidad","Descripción de Homosexualidad","Describir Homosexualidad","Significado de Homosexualidad","Concepto de Homosexualidad","Expresión de Homosexualidad","Homosexualidad","homosexual"],
        "responses": [
            "Homosexualidad es la orientación sexual en la que una persona siente atracción romántica y sexual hacia personas del mismo sexo.",
            "Homosexualidad es cuando alguien se siente atraído emocional y sexualmente por individuos del mismo género.",
            "La homosexualidad es la orientación sexual en la que una persona experimenta atracción romántica y sexual hacia personas de su mismo sexo."
        ]
    },
    {
        "tag": "Bisexualidad",
        "patterns": ["Qué es la bisexualidad ","Explicar bisexualidad","Explicación de bisexualidad","Descripción de bisexualidad","Describir bisexualidad","Significado de bisexualidad","Concepto de bisexualidad","Expresión de bisexualidad","bisexualidad","bisexual"],
        "responses": [
            "La bisexualidad es una orientación sexual en la que una persona se siente atraída emocional, romántica y/o sexualmente hacia individuos de más de un género, lo que puede incluir géneros masculinos, femeninos y no binarios.",
            "La bisexualidad se refiere a la capacidad de una persona para experimentar atracción tanto hacia personas del mismo género como del género opuesto. Las personas bisexuales tienen la capacidad de establecer relaciones románticas y sexuales con individuos de diferentes identidades de género.",
            "La bisexualidad es una orientación sexual diversa y variada en la que las personas se sienten atraídas por una amplia gama de géneros, sin importar si son hombres, mujeres, o identidades de género no binarias. Esta atracción puede ser emocional, romántica y/o sexual, y varía en intensidad y preferencia de una persona a otra."
        ]
    },
    {
        "tag": "Pansexualidad",
        "patterns": ["Qué es la pansexualidad","Explicar pansexualidad","Explicación de pansexualidad","Descripción de pansexualidad","Describir pansexualidad","Significado de pansexualidad","Concepto de pansexualidad","Expresión de pansexualidad","pansexualidad","pansexual"],
        "responses": [
            "La pansexualidad es la atracción hacia personas sin importar su género, incluyendo hombres, mujeres, y personas con identidades de género no binarias",
            "La pansexualidad implica sentir atracción romántica, emocional y sexual hacia individuos independientemente de su identidad de género.",
            "La pansexualidad se caracteriza por la capacidad de sentir atracción por personas de todos los géneros, sin restricciones basadas en la identidad de género."
        ]
    },
   
    {
        "tag": "Asexualidad",
        "patterns": ["Qué es asexualidad","Explicar asexualidad","Explicación de asexualidad","Descripción de asexualidad","Describir asexualidad","Significado de asexualidad","Concepto de asexualidad","Expresión de asexualidad","asexualidad","asexual"],
        "responses": [
            "La asexualidad es una orientación sexual en la cual una persona no experimenta atracción sexual hacia otras personas.",
            "La asexualidad es la falta de interés o deseo sexual hacia cualquier género o individuo. Las personas asexuales pueden experimentar conexiones emocionales y románticas, pero no sienten necesidad de actividad sexual.",
            "La asexualidad es una identidad sexual en la que alguien no siente atracción sexual hacia nadie. Las personas asexuales pueden tener relaciones íntimas y emocionales, pero el componente sexual no es una parte fundamental de su orientación."
        ]
    },
    {
        "tag": "Demisexualidad",
        "patterns": ["Qué es demisexualidad","Explicar demisexualidad","Explicación de demisexualidad","Descripción de demisexualidad","Describir demisexualidad","Significado de demisexualidad","Concepto de demisexualidad","Expresión de demisexualidad","demisexualidad","demisexual"],
        "responses": [
            "La demisexualidad es la atracción sexual que se desarrolla solo después de establecer una conexión emocional fuerte con alguien.",
            "La demisexualidad implica sentir atracción sexual solo cuando existe un lazo emocional profundo con la persona.",
            "La demisexualidad se caracteriza por experimentar atracción sexual después de formar una conexión emocional significativa con alguien en particular."
        ]
    },
    {
        "tag": "Graysexualidad",
        "patterns": ["Qué es la graysexualidad","Explicar graysexualidad","Explicación de graysexualidad","Descripción de graysexualidad","Describir graysexualidad","Significado de graysexualidad","Concepto de graysexualidad","Expresión de graysexualidad","graysexualidad","graysexual"],
        "responses": [
            "La graysexualidad es una orientación sexual en la que una persona experimenta atracción sexual en raras ocasiones o en circunstancias específicas.",
            "La graysexualidad se refiere a alguien que experimenta atracción sexual de forma ocasional, fluctuante o en intensidad limitada.",
            "La graysexualidad es una identidad sexual donde la atracción sexual es variable, no siendo ni completamente asexual ni plenamente sexual."
        ]
    },
    {
        "tag": "OrientacionSexualFluctuante",
        "patterns": ["Qué es la orientación sexual fluctuante","Explicar orientación sexual fluctuante","Explicación de orientación sexual fluctuante","Descripción de orientación sexual fluctuante","Describir orientación sexual fluctuante","Significado de orientación sexual fluctuante","Concepto de orientación sexual fluctuante","Expresión de orientación sexual fluctuante","orientación sexual fluctuante"],
        "responses": [
            "La orientación sexual fluctuante se refiere a la capacidad de una persona para experimentar cambios en su atracción sexual a lo largo del tiempo.",
            "Es cuando una persona experimenta variaciones en su atracción hacia diferentes géneros en momentos diferentes, sin adherirse a una orientación fija.",
            "La orientación sexual fluctuante implica que una persona puede sentirse atraída por diferentes géneros en distintas etapas de su vida o en situaciones emocionales cambiantes."
        ]
    },
    {
        "tag": "QueEsLaIdentidadDeGenero",
        "patterns": ["Qué es la identidad de género","Explicación de dentidad de género","Descripción de dentidad de género","Describir dentidad de género","Significado de dentidad de género","Concepto de dentidad de género","Expresión de dentidad de género","identidad de género"],
        "responses": [
            "La identidad de género es la experiencia interna y profunda de ser hombre, mujer, o una identidad de género diferente. No siempre coincide con el sexo asignado al nacer.",
            "Es la percepción interna de uno mismo como hombre, mujer, ambos, ninguno o un género diferente al asignado al nacer. La identidad de género no se limita a las categorías tradicionales de masculino o femenino.",
            "La identidad de género es cómo una persona se identifica y se siente respecto a su género, lo cual puede ser masculino, femenino, o cualquier otra identidad de género con la que se identifique. Es una experiencia única para cada individuo."
        ]
    },
    {
        "tag": "QueEsLgbtiq",
        "patterns": ["Qué es lgbtiq","Explicación de lgbtiq","Descripción de lgbtiq","Describir lgbtiq","Significado de lgbtiq","Concepto de lgbtiq","Expresión de lgbtiq","lgbtiq+","lgbtiq","lgbti","lgbt","lgb"],
        "responses": [
            "LGBTIQ+ es un acrónimo que representa a lesbianas, gays, bisexuales, personas transgénero, intersexuales y el símbolo de más (+) denota inclusión para otras identidades sexuales y de género.",
            "LGBTIQ+ es un término inclusivo que abarca diversas orientaciones sexuales y identidades de género, como lesbianas, gays, bisexuales, personas transgénero, intersexuales y otras identidades no conformes con las normas tradicionales.",
            "LGBTIQ+ representa una comunidad diversa, incluyendo a personas lesbianas, gays, bisexuales, transgénero, intersexuales y otras identidades sexuales y de género, mostrando el compromiso con la inclusión de todas las orientaciones y expresiones de género."
        ]
    },
    {
        "tag": "PersonasLesbianas",
        "patterns": ["Qué es una persona lesbiana","Explicación de lesbiana","Descripción de lesbiana","Describir lesbiana","Significado de lesbiana","Concepto de lesbiana","Expresión de lesbiana","lesbiana"],
        "responses": [
            "Lesbianas son mujeres que tienen atracción romántica, emocional y/o sexual hacia otras mujeres.",
            "El término lesbianas se refiere a mujeres homosexuales, es decir, mujeres que tienen relaciones románticas y sexuales con otras mujeres.",
            "Lesbianas son mujeres que se sienten atraídas emocional y sexualmente por personas del mismo sexo, y se identifican como parte de la comunidad LGBTQ+."
        ]
    },
    {
        "tag": "PersonasGays",
        "patterns": ["Qué es Persona gay","Explicación de gay","Descripción de gay","Describir gay","Significado de gay","Concepto de gay","Expresión de gay", "gay"],
        "responses": [
            "Gays son hombres que tienen atracción romántica, emocional y/o sexual hacia otros hombres.",
            "El término gays se refiere a hombres homosexuales, es decir, hombres que tienen relaciones románticas y sexuales con otros hombres.",
            "Gays son hombres que se sienten atraídos emocional y sexualmente por personas del mismo sexo."
        ]
    },
    {
        "tag": "Transgenero",
        "patterns": ["Qué es Persona Transgénero","Explicación de Transgénero","Descripción de Transgénero","Describir Transgénero","Significado de Transgénero","Concepto de Transgénero","Expresión de Transgénero","Transgénero"],
        "responses": [
            "Transgénero es un término que se refiere a personas cuya identidad de género difiere del sexo asignado al nacer.",
            "Transgénero describe a individuos cuya identidad de género no coincide con el género que se les asignó al nacer, y pueden tomar medidas para vivir de acuerdo con su identidad de género.",
            "Personas transgénero son aquellas cuya experiencia interna de género es diferente de la que se les asignó al nacer, y pueden identificarse como hombre, mujer, o con una identidad de género no binaria, entre otras identidades."
        ]
    },{
        "tag": "Intersexual",
        "patterns": ["Qué es Intersexual","Explicación de Intersexual","Descripción de Intersexual","Describir Intersexual","Significado de Intersexual","Concepto de Intersexual","Expresión de Intersexual", "Intersexual"],
        "responses": [
            "Intersexual es un término que se refiere a personas que nacen con características sexuales que no se ajustan típicamente a las definiciones de sexo masculino o femenino.",
            "Las personas intersexuales tienen variaciones biológicas en sus características sexuales, como genitales, cromosomas o hormonas, que no se alinean claramente con las definiciones tradicionales de masculino o femenino.",
            "Intersexual es un estado biológico en el que una persona presenta diferencias en su anatomía sexual, lo que puede incluir genitales ambivalentes o variaciones en los cromosomas sexuales, haciendo que no se clasifiquen fácilmente como exclusivamente masculinos o femeninos."
        ]
    },

    {
        "tag": "DiferenciaEntreOrientaciónSexualYIdentidadDeGenero",
        "patterns": ["diferencia entre orientación sexual y identidad de género", "distinción entre orientación sexual y identidad de género","es lo mismo orientación sexual y identidad de género","orientación sexual y identidad de género"],
        "responses": [
            "La orientación sexual se trata de a quiénes sentimos atracción, como hombres, mujeres o ambos. La identidad de género es quiénes creemos ser en términos de género, como hombre, mujer o no binario.",
            "La orientación sexual se refiere a quiénes amamos y nos sentimos atraídos, mientras que la identidad de género es cómo nos identificamos internamente como hombre, mujer, u otra identidad de género.",
            "La orientación sexual se centra en a quiénes encontramos atractivos, mientras que la identidad de género se trata de quiénes somos en términos de nuestro sentido interno de ser hombre, mujer, o una identidad de género no binaria."
        ]
    }
    ,
    {
        "tag": "RecursosAyuda",
        "patterns": ["encontrar ayuda", "encontrar recursos","que hago si soy victiva"],
        "responses": [
            "Si eres víctima de violencia de género o conoces a alguien que lo es, puedes comunicarte con líneas de ayuda como [número de teléfono] para recibir apoyo confidencial.",
            
            "Organizaciones como [nombres de organizaciones] también proporcionan recursos y orientación para ayudar a las víctimas a salir de situaciones abusivas.",
            "Es importante buscar apoyo y hablar sobre la situación para poder tomar medidas para tu seguridad y bienestar."
        ]
    }
    ,
    {
        "tag": "PerspectivaDeDerechos",
        "patterns": ["Perspectiva de Derechos"],
        "responses": [
            "La perspectiva de derechos reconoce a las personas como titulares activas de derechos civiles, políticos, económicos, sociales y culturales, que son universales e interdependientes.",
            "Los derechos son indivisibles, universales e irrenunciables, reconociendo a las personas como ciudadanas libres con un conjunto completo de derechos."
            ]
    }
    ,
    {
        "tag": "PerspectivaDeGénero",
        "patterns": ["Perspectiva de Género"],
        "responses": [
            "La perspectiva de género es una herramienta que destaca las desigualdades entre hombres y mujeres, incluyendo a personas con diversas identidades y orientaciones de género que enfrentan discriminación por cuestionar las normas heteronormativas y binarias de género.",
            "La perspectiva de género revela desigualdades en las relaciones entre hombres y mujeres, reconociendo también a personas con identidades y orientaciones de género diversas que desafían las normas tradicionales de género, lo que a menudo resulta en discriminación."
            ]
    }

    ,
    {
        "tag": "QueEsViolencia ",
        "patterns": ["Qué es violencia","Explicar violencia","Explicación de violencia","Descripción de violencia","Describir violencia","Significado de violencia","Concepto de violencia","Expresión de violencia","violencia"],
        "responses": [
            "Violencia es dañar a otros física o emocionalmente",
            "Violencia es el uso de la fuerza para lastimar a alguien."
            
            ]
    }
    ,
    {
        "tag": "TiposDeViolencia ",
        "patterns": ["tipos de violencia","clases de Violencia","Categorias de violencia","Cualidades de violencia"],
        "responses": [
            "Los tipos de violencia se refieren a las categorías o formas en que se manifiesta la agresión, el abuso o la coerción hacia otras personas o grupos. Estos tipos pueden incluir, entre otros, violencia física, psicológica, sexual y verbal.",
            "Los tipos de violencia son las diversas formas en que se ejerce el poder o control de manera que daña a otra persona, ya sea mediante el uso de fuerza física, abuso emocional, explotación sexual, discriminación u opresión."
            ]
    }
    ,
    {
        "tag": "ConsecuenciasDeViolencia",
        "patterns": ["Consecuencias de violencia","efectos de violencia","secuela deviolencia","Derivación de violencia"],
        "responses": [
            "La violencia puede causar problemas de salud mental, como ansiedad y depresión.",
            "La violencia puede causar lesiones físicas y emocionales, perpetuar un ciclo de abuso generacional y llevar al aislamiento social y problemas legales."

            ]
    }
    ,
    {
        "tag": "CausasDeViolencia",
        "patterns": ["causa de violencia","Motivos de violencia","Razones de violencia","factores de violencia","casos de violencia"],
        "responses": [
            "La disparidad en la distribución de recursos y oportunidades puede generar frustración y resentimiento, lo que a menudo desencadena actos violentos.",
            "Las disputas no resueltas en las relaciones personales pueden llevar a la violencia, ya sea en el hogar o en la comunidad.",
            "Creencias arraigadas, la presión de grupo y la influencia de la cultura pueden fomentar la violencia en algunas comunidades."
            ]
    }
    ,
    {
        "tag": "QueHacerVictimaViolencia",
        "patterns": ["Víctimas de violencia","Hago si soy victima de violencia","afectado de violencia"],
        "responses": [
            "Busca seguridad: Prioriza tu seguridad y busca un lugar seguro de inmediato. Habla con alguien de confianza , comunica tu situación a un amigo, familiar o profesional de la salud. Llama a la policía si estás en peligro, contacta a las autoridades para denunciar la violencia y buscar protección."
            ]
    }
    ,
    {
        "tag": "SeñalesVictimaViolencia",
        "patterns": ["como saber si soy victima de violencia","señales de violencia"],
        "responses": [
            "Esto puede implicar golpes, empujones, bofetadas o cualquier forma de contacto físico no consensuado que cause daño o miedo a la víctima.",
            "Las palabras pueden ser armas poderosas. Las amenazas, insultos, humillaciones y declaraciones intimidantes pueden ser señales de violencia verbal.",
            "se manifiesta a través de la manipulación, el control excesivo, la degradación y la invalidación de los sentimientos de la víctima, lo que puede causar daño psicológico."
            ]
    }
    ,

    {
        "tag": "QueEsExpresiónDeGenero",
        "patterns": ["Qué es expresión de género","Explicar expresión de género","Explicación de expresión de género","Descripción de expresión de género","Describir expresión de género","Significado de expresión de género","Concepto de expresión de género","Expresión de expresión de género","expresión de género"],
        "responses": [
            "La expresión de género es cómo una persona muestra su identidad a través de comportamientos y apariencia, que pueden ser conformes o no conformes a las expectativas sociales de género.",
            "Es la forma en que alguien se presenta al mundo, incluyendo la ropa, el peinado y el comportamiento, reflejando su identidad de género interna.",
            "La expresión de género es la manera en que una persona comunica su identidad a través de su apariencia y comportamiento, pudiendo ser tradicional o divergente respecto a las normas de género establecidas."
        ]
    },
    {
        "tag": "EjemploDeExpresiónDeGenero",
        "patterns": ["Qué es expresión de género","Explicar expresión de género","Explicación de expresión de género","Descripción de expresión de género","Describir expresión de género","Significado de expresión de género","Concepto de expresión de género","Expresión de expresión de género","expresión de género"],
        "responses": [
            "Un ejemplo de expresión de género es cuando una persona asignada como hombre al nacer elige vestir prendas tradicionalmente femeninas y adoptar un estilo de peinado y maquillaje asociados con lo femenino.",
            "Otra forma de expresión de género es cuando alguien asignado como mujer al nacer decide usar ropa y accesorios más masculinos, desafiando las normas de género convencionales.",
            "Otro ejemplo de expresión de género es cuando una persona, independientemente de su asignación al nacer, decide adoptar un estilo de vestimenta y comportamiento que no se ajusta a las normas tradicionales de género."
        ]
    },
    {
        "tag": "QuiénMuestraLaExpresiónDeGenero",
        "patterns": ["Quién muestra la expresión de género", "Explícame en detalle quién muestra la expresión de género","personas que muestran la expresión de género"],
        "responses": [
            "Todas las personas, independientemente de su identidad de género, muestran expresión de género a través de su apariencia y comportamiento.",
            "La expresión de género es una característica común a todas las personas, no limitada a un grupo específico.",
            "Cada individuo tiene su propia forma única de expresar su género, independientemente de su identidad de género, a través de su comportamiento y apariencia."
        ]
    },
    {
        "tag": "CómoSeManifiestaLaExpresiónDeGenero",
        "patterns": ["Cómo se manifiesta la expresión de género", "Explícame Cómo se manifiesta la expresión de género","De qué forma se manifiesta la expresión de género"],
        "responses": [
            "La expresión de género se manifiesta a través de la forma de vestir, el comportamiento y las interacciones sociales de una persona.",
            "Se refleja en la elección de ropa, gestos y roles que una persona adopta, mostrando su identidad de género.",
            "La expresión de género se ve en la apariencia, comportamiento y relaciones de una persona, indicando cómo se identifican internamente en términos de género."
        ]
    },
    {
        "tag": "PorquéSeDaLaExpresiónDeGenero",
        "patterns": ["Porque se da la expresión de género", "Explícame porque se da la expresión de género","porqué surge la expresión de género"],
        "responses": [
            "Las expresiones de género surgen de la diversidad natural de las personas y cómo cada individuo se relaciona con las expectativas sociales de género.",
            "Están influenciadas por factores biológicos, sociales y culturales, lo que lleva a una amplia variedad de identidades y formas de expresar el género.",
            "Cada persona es única, lo que resulta en una diversidad de expresiones de género, ya que cada individuo interpreta y vive su identidad de género de manera diferente."
        ]
    },
    {
        "tag": "QuéEsViolenciaFisica",
        "patterns": ["Que es la violencia fisica","Explicar violencia fisica","Explicación de violencia fisica","Descripción de violencia fisica","Describir violencia fisica","Significado de violencia fisica","Concepto de violencia fisica","Expresión de violencia fisica","violencia fisica"],
        "responses": [
            "La violencia física puede ser el resultado de una combinación de factores individuales, sociales y emocionales, incluidos conflictos personales, abuso de sustancias, problemas de salud mental, presión de grupo y desigualdad social.",
            "La violencia física es la acción de herir o lastimar a alguien mediante el uso de la fuerza física, como golpes, patadas o puñetazos.",
            "La violencia física implica cualquier acto en el que una persona inflige daño físico a otra a través de acciones como agresiones físicas, asaltos o cualquier forma de violencia que tenga un componente físico evidente"    
        ]
    },
    {
        "tag": "EjemploDeViolenciaFisica",
        "patterns": ["Dame un ejemplo de violencia fisica","Proporciona un caso de violencia física","Podrías darme un ejemplo de violencia física","Tienes un ejemplo de violencia física","Tienes un ejemplo concreto de violencia física","Tienes algún ejemplo práctico de violencia física"],
        "responses": [
            "La violencia física implica el uso de la fuerza para causar daño físico, como golpes, patadas o estrangulamiento, infligiendo dolor o lesiones a la víctima.",
            "Un ejemplo de violencia física es cualquier acto que cause daño físico directo, como golpear o empujar a otra persona, resultando en lesiones evidentes o dolor.",
            "La violencia física implica agresiones directas que causan daño físico, como puñetazos o patadas, manifestándose en lesiones corporales y dolor para la víctima."
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaFísica",
        "patterns": ["Cuáles son los signos físicos de la violencia física","Háblame sobre los signos de violencia física","Explícame los signos de violencia física"],
        "responses": [
            "Los signos de violencia física incluyen lesiones inexplicables, dolor persistente y cambios emocionales.",
            "Los signos de violencia física incluyen lesiones inexplicables, dolor persistente y cambios emocionales como miedo o evitación del contacto físico.",
            "Los signos de violencia física incluyen lesiones visibles, dolor persistente, dificultades para moverse y cambios emocionales como miedo o evitación del contacto físico. "    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaFísica",
        "patterns": ["En qué lugares se da la violencia física","Explícame los entornos donde ocurre la violencia física","Dónde se da la violencia física"],
        "responses": [
            "La violencia física se manifiesta en diversos contextos, incluyendo relaciones familiares y de pareja, conflictos escolares y peleas comunitarias. También ocurre en instituciones y puede dirigirse hacia niños o incluso ser autodirigida.",
            "Los tipos de violencia física abarcan agresiones en el hogar, parejas íntimas, escuelas y comunidades. Además, se observa en instituciones y puede afectar a niños y adultos. Incluso las autolesiones son consideradas una forma de violencia física.",
            "La violencia física se presenta en diferentes ámbitos, como el hogar, relaciones románticas, escuelas y espacios públicos."    
        ]
    },

    {
        "tag": "CuálesSonLasCausasDeViolenciaFísica",
        "patterns": ["Cuáles son las causas más comunes de la violencia física","Cuáles son las principales causas de la violencia física","Causas de Violencia física"],
        "responses": [
            "La violencia física puede originarse por desigualdades económicas, discriminación, problemas de salud mental y normas culturales que toleran la agresión. También puede surgir de experiencias traumáticas en la infancia y entornos violentos.",
            "La violencia física tiene raíces en desigualdades sociales, discriminación y falta de acceso a recursos. Factores como problemas de salud mental y exposición a la violencia en la infancia también contribuyen a su aparición.",
            "La violencia física se origina en factores complejos como desigualdades económicas, discriminación y normas culturales tolerantes hacia la agresión. Problemas de salud mental, historiales de abuso y entornos violentos también están implicados en su aparición."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaFísica",
        "patterns": ["Cuáles son las consecuencias de la violencia física","Háblame sobre las consecuencias de la violencia física","Consecuencias fisicas"],
        "responses": [
            "La violencia física puede contribuir a la perpetuación de ciclos de violencia en la sociedad y causar daños mentales y emocionales  a largo plazo tanto a las víctimas como a los perpetradores.",
            "La violencia física conlleva graves consecuencias para todas las partes involucradas. Esto incluye lesiones físicas, trauma emocional, deterioro de relaciones, posibles problemas legales, costos financieros, efectos negativos en los niños testigos, y una contribución a la perpetuación de ciclos de violencia en la sociedad.",
            "La violencia física tiene ramificaciones significativas. Puede causar daños físicos directos, así como un dolor emocional profundo en las víctimas. Esto puede llevar a la ruptura de relaciones y, en algunos casos, a un ciclo continuo de abuso."
        ]
    },
    {
        "tag": "QuéEsViolenciaPsicológica",
        "patterns": ["Que es la violencia psicológica","Explicar violencia psicológica","Explicación de violencia psicológica","Descripción de violencia psicológica","Describir violencia psicológica","Significado de violencia psicológica","Concepto de violencia psicológica","Expresión de violencia psicológica","violencia psicológica"],
        "responses": [
            "Violencia psicológica es el uso de tácticas para controlar, humillar o intimidar emocionalmente a alguien, sin causar daño físico visible.",
            "Es el maltrato que daña emocionalmente a una persona, incluyendo insultos, amenazas, manipulación y control excesivo.",
            "Significa utilizar comportamientos para controlar y herir emocionalmente a alguien, como insultos, amenazas y manipulación, sin dejar marcas físicas."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaPsicológica",
        "patterns": ["Cuáles son los signos físicos de la violencia Psicológica","Háblame sobre los signos de violencia Psicológica","Explícame los signos de violencia Psicológica"],
        "responses": [
            "Signos de violencia psicológica incluyen ansiedad, baja autoestima, aislamiento social y cambios en el comportamiento.",
            "Se manifiesta en ansiedad, dependencia emocional y cambios en la personalidad y las relaciones sociales.",
            "Indicadores son baja autoestima, miedo constante y pérdida de interés en actividades previas."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciPsicológica",
        "patterns": ["En qué lugares se da la violencia Psicológica","Explícame los entornos donde ocurre la violencia Psicológica","Dónde se da la violencia Psicológica"],
        "responses": [
            "La violencia psicológica puede ocurrir en el hogar, en parejas y familias, en el trabajo y en entornos escolares.",
            "Se da en relaciones interpersonales, como en parejas, familias y amistades, así como en el trabajo y en el entorno escolar.",
            "Puede manifestarse en cualquier lugar donde existan relaciones interpersonales, como en el hogar, en el trabajo y en entornos educativos y sociales."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaPsicológica",
        "patterns": ["Cuáles son las causas más comunes de la violencia Psicológica","Cuáles son las principales causas de la violencia Psicológica","Causas de Violencia Psicológica"],
        "responses": [
            "La violencia psicológica puede surgir debido a problemas de control, desigualdades de género y traumas infantiles, pero ninguna razón justifica el abuso emocional en una relación.",
            "Factores como problemas de poder, modelos de comportamiento aprendidos y falta de empatía pueden contribuir a la violencia psicológica, pero es importante recordar que el abuso emocional no tiene justificación y debe ser tratado seriamente.",
            "La violencia psicológica puede ser resultado de problemas de comunicación, celos y estrés, pero ninguna causa valida el maltrato emocional. Es fundamental abordar este tipo de abuso con seriedad y buscar apoyo adecuado."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaPsicológica",
        "patterns": ["Cuáles son las consecuencias de la violencia psicológica","Háblame sobre las consecuencias de la violencia psicológica","Consecuencias psicológica"],
        "responses": [
            "La violencia psicológica causa baja autoestima, problemas emocionales y aislamiento social, afectando relaciones y salud mental.",
            "Víctimas pueden sufrir baja autoestima, aislarse socialmente y tener problemas emocionales y físicos debido a la violencia psicológica.",
            "Violencia psicológica impacta negativamente en la autoestima, relaciones, salud mental y puede perpetuar el ciclo de abuso en futuras generaciones."
        ]
    },

    {
        "tag": "QuéEsViolenciaSexual",
        "patterns": ["Que es la violencia sexual","Explicar violencia sexual","Explicación de violencia sexual","Descripción de violencia sexual","Describir violencia sexual","Significado de violencia sexual","Concepto de violencia sexual","Expresión de violencia sexual","violencia sexual"],
        "responses": [
            "Es cualquier forma de actividad sexual forzada o no consensuada, que incluye violación, acoso, abuso y explotación sexual. Implica el uso de la fuerza, la coerción o la manipulación para controlar y degradar a la víctima.",
            "Se refiere a cualquier acto sexual sin el consentimiento de todas las personas involucradas. Esto abarca desde violaciones y agresiones sexuales hasta el acoso y la explotación sexual.",
            "Consiste en cualquier actividad sexual impuesta sin consentimiento, lo que puede incluir coerción, intimidación o abuso de poder."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaSexual",
        "patterns": ["Cuáles son los signos físicos de la violencia sexual","Háblame sobre los signos de violencia sexual","Explícame los signos de violencia sexual"],
        "responses": [
            "Signos de violencia sexual incluyen cambios en el comportamiento, problemas de salud, alteraciones en las relaciones, bajo rendimiento académico o laboral, expresiones indirectas sobre el abuso y síntomas físicos inexplicables.",
            "Los indicios pueden ser cambios en el comportamiento, problemas de salud, dificultades en las relaciones, deterioro en el rendimiento académico o laboral, expresiones indirectas sobre el abuso y síntomas físicos sin explicación.",
            "Los signos son incluyen cambios en comportamiento, problemas de salud, dificultades en relaciones, bajo rendimiento académico o laboral, expresiones indirectas sobre el abuso y síntomas físicos inexplicables."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciSexual",
        "patterns": ["En qué lugares se da la violencia sexual","Explícame los entornos donde ocurre la violencia sexual","Dónde se da la violencia sexual"],
        "responses": [
            "La violencia sexual puede ocurrir en el hogar, el trabajo, espacios públicos, instituciones y relaciones íntimas. Es un problema global que afecta a personas de todas las edades y géneros.",
            "La violencia sexual puede suceder en casa, en el trabajo, en instituciones y espacios públicos. Afecta a personas de todas las edades y géneros en todo el mundo.",
            "La violencia sexual se presenta en el hogar, en el trabajo, en espacios públicos y en relaciones íntimas. Es un problema global que afecta a personas de todas las edades y géneros."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaSexual",
        "patterns": ["Cuáles son las causas más comunes de la violencia sexual","Cuáles son las principales causas de la violencia sexual","Causas de Violencia sexual"],
        "responses": [
            "Las causas de la violencia sexual involucran desigualdades de género, normas sociales perjudiciales y problemas psicológicos en los perpetradores, además de falta de educación sobre el consentimiento.",
            "Factores como desigualdades de género, poder y control, junto con normas sociales nocivas y falta de educación sobre consentimiento, contribuyen a la violencia sexual.",
            "La violencia sexual surge de desigualdades de género, normas sociales dañinas y problemas psicológicos en los perpetradores, agravados por la falta de conciencia sobre el consentimiento."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaSexual",
        "patterns": ["Cuáles son las consecuencias de la violencia sexual","Háblame sobre las consecuencias de la violencia sexual","Consecuencias sexual"],
        "responses": [
            "Las consecuencias de la violencia sexual incluyen lesiones físicas, trastornos mentales como ansiedad y depresión, disfunción sexual y problemas en las relaciones.",
            "Víctimas de violencia sexual pueden experimentar trauma físico, emocional y social, incluyendo trastornos de estrés postraumático, autolesiones y dificultades en relaciones.",
            "Las secuelas de la violencia sexual abarcan problemas físicos, trastornos mentales, dificultades en relaciones y estigmatización social, impactando profundamente la vida de las víctimas."
        ]
    },
    {
        "tag": "QuéEsViolenciaSimbólica",
        "patterns": ["Que es la violencia simbólica","Explicar violencia simbólica","Explicación de violencia simbólica","Descripción de violencia simbólica","Describir violencia simbólica","Significado de violencia simbólica","Concepto de violencia simbólica","Expresión de violencia simbólica","violencia simbólica"],
        "responses":[
            "La violencia simbólica implica el uso de símbolos, palabras o gestos para humillar y controlar a personas o grupos, perpetuando desigualdades y discriminación.",
            "Es una forma indirecta de violencia que utiliza símbolos y palabras para marginar y controlar, creando desigualdades y limitando oportunidades.",
            "La violencia simbólica utiliza gestos y símbolos para discriminar y humillar, manteniendo estructuras de poder desiguales y restringiendo las libertades de individuos y comunidades."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaSimbólca",
        "patterns": ["Cuáles son los signos físicos de la violencia simbólica","Háblame sobre los signos de violencia simbólica","Explícame los signos de violencia simbólica"],
        "responses": [
            "Signos de violencia simbólica incluyen el uso de palabras, gestos o símbolos para humillar o marginar personas, causando baja autoestima y aislamiento social.",
            "Pueden ser gestos, palabras o imágenes que denigran a personas o grupos, causando ansiedad, baja autoestima y limitaciones en la expresión.",
            "Son acciones que usan símbolos o palabras para marginar y controlar, llevando a víctimas a sentirse aisladas, ansiosas y con baja autoestima."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciSimbólica",
        "patterns": ["En qué lugares se da la violencia simbólica","Explícame los entornos donde ocurre la violencia simbólica","Dónde se da la violencia simbólica"],
        "responses": [
            "La violencia simbólica puede ocurrir en el hogar, en el trabajo, en los medios de comunicación, en la sociedad y en instituciones educativas.",
            "Se encuentra en el hogar, en el trabajo, en los medios de comunicación, en las interacciones sociales y en las instituciones educativas.",
            "La violencia simbólica se manifiesta en múltiples contextos, como en el hogar, en el trabajo, en los medios de comunicación y en la sociedad en general."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaSimbólica",
        "patterns": ["Cuáles son las causas más comunes de la violencia simbólica","Cuáles son las principales causas de la violencia simbólica","Causas de Violencia simbólica"],
        "responses": [
            "La violencia simbólica se origina en desigualdades sociales como género y raza, manifestándose a través de símbolos, palabras y gestos que perpetúan discriminación y poder desigual.",
            "Las causas de la violencia simbólica incluyen desigualdades de género y racismo, manifestándose a través de símbolos y palabras que humillan y perpetúan la discriminación.",
            "La violencia simbólica surge de desigualdades sociales, expresándose a través de símbolos y gestos que denigran y marginan grupos específicos, perpetuando así el poder desigual y la discriminación."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaSimbólica",
        "patterns": ["Cuáles son las consecuencias de la violencia simbólica","Háblame sobre las consecuencias de la violencia simbólica","Consecuencias simbólica"],
        "responses": [
            "Las consecuencias de la violencia simbólica incluyen daño emocional, baja autoestima y perpetuación de estereotipos, afectando la autoimagen y oportunidades de las personas.",
            "Resulta en daño emocional, baja autoestima y perpetuación de desigualdades sociales, limitando las oportunidades de las personas y comunidades afectadas.",
            "Provoca daño emocional, perpetúa estereotipos y desigualdades, afectando la autoimagen y oportunidades de las personas, y contribuyendo a un ciclo de violencia y discriminación."
        ]
    },


    {
        "tag": "QuéEsViolenciaPatrimonial",
        "patterns": ["Que es la violencia patrimonial","Explicar violencia patrimonial","Explicación de violencia patrimonial","Descripción de violencia patrimonial","Describir violencia patrimonial","Significado de violencia patrimonial","Concepto de violencia patrimonial","Expresión de violencia patrimonial","violencia patrimonial"],
        "responses": [
            "La violencia patrimonial implica controlar o dañar los bienes y recursos económicos de la víctima para ejercer poder y control, dejándola vulnerable y dependiente.",
            "Es un tipo de abuso que involucra manipulación financiera, retención de dinero o destrucción de bienes para controlar y limitar la independencia económica de la víctima.",
            "La violencia patrimonial implica la manipulación económica y la destrucción intencional de bienes para controlar a la víctima, dejándola económicamente dependiente y vulnerable."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaPatrimonial",
        "patterns": ["Cuáles son los signos físicos de la violencia patrimonial","Háblame sobre los signos de violencia patrimonial","Explícame los signos de violencia patrimonial"],
        "responses": [
            "Signos de violencia patrimonial incluyen control excesivo sobre el dinero, restricción del acceso a recursos financieros, destrucción intencional de bienes y forzar a la víctima a firmar documentos financieros.",
            "Se manifiesta a través de restricciones en el acceso a recursos económicos, control total sobre las finanzas, destrucción de bienes y manipulación financiera para crear dependencia.",
            "Los signos incluyen negación de acceso a cuentas bancarias, control económico excesivo, destrucción intencional de propiedades y manipulación para limitar la independencia financiera de la víctima."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciPatrimonial",
        "patterns": ["En qué lugares se da la violencia patrimonial","Explícame los entornos donde ocurre la violencia patrimonial","Dónde se da la violencia patrimonial"],
        "responses": [
            "La violencia patrimonial puede ocurrir en el hogar, en relaciones de pareja o familiares, donde alguien controla los recursos financieros y propiedades para manipular y mantener poder sobre la víctima.",
            "Se presenta en relaciones familiares o de pareja, donde alguien restringe el acceso a recursos económicos, controla propiedades y finanzas para ejercer poder sobre la víctima.",
            "La violencia patrimonial puede suceder en cualquier contexto, especialmente en relaciones íntimas, donde se controlan los recursos económicos y bienes para mantener la dependencia y el control sobre la víctima."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaPatrimonial",
        "patterns": ["Cuáles son las causas más comunes de la violencia patrimonial","Cuáles son las principales causas de la violencia patrimonial","Causas de Violencia patrimonial"],
        "responses": [
            "La violencia patrimonial se origina en el deseo de controlar a la víctima, perpetuar roles de género tradicionales y la falta de conciencia sobre los derechos económicos y la autonomía personal.",
            "Suele ser causada por el deseo de control, actitudes machistas y patriarcales, así como la falta de educación sobre los derechos económicos y la independencia financiera.",
            "Las causas incluyen la necesidad de dominio, roles de género arraigados y falta de conciencia sobre los derechos económicos, llevando al control y la manipulación de los recursos financieros de la víctima."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaPatrimonial",
        "patterns": ["Cuáles son las consecuencias de la violencia patrimonial","Háblame sobre las consecuencias de la violencia patrimonial","Consecuencias patrimonial"],
        "responses": [
            "Las consecuencias de la violencia patrimonial incluyen dependencia económica, pérdida de autonomía, baja autoestima, ansiedad y aislamiento social.",
            "Puede resultar en dependencia financiera, pérdida de independencia, daño a la autoestima y problemas emocionales como ansiedad y depresión.",
            "Provoca dependencia económica, deterioro de la autoestima, aislamiento social y dificultades para buscar ayuda, manteniendo a la víctima atrapada en la relación abusiva."
        ]
    },


    {
        "tag": "QuéEsViolenciaEconómica",
        "patterns": ["Que es la violencia económica","Explicar violencia económica","Explicación de violencia económica","Descripción de violencia económica","Describir violencia económica","Significado de violencia económica","Concepto de violencia económica","Expresión de violencia económica","violencia económica"],
        "responses": [
            "La violencia económica implica control y manipulación de los recursos financieros de la víctima, restringiendo su acceso al dinero y creando dependencia económica.",
            "Se refiere a la manipulación de recursos financieros, como restringir el acceso al dinero o impedir el empleo, con el objetivo de controlar y limitar la independencia económica de la víctima.",
            "Implica el control de los recursos económicos de la víctima, como restringir el acceso al dinero o forzar la dependencia financiera, con el propósito de ejercer poder y control sobre ella."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaEconómica",
        "patterns": ["Cuáles son los signos físicos de la violencia económica","Háblame sobre los signos de violencia económica","Explícame los signos de violencia económica"],
        "responses": [
            "Signos de violencia económica son el control excesivo del dinero, impedir que la víctima trabaje o estudie, restringir el acceso a recursos financieros y destruir propiedades.",
            "Pueden incluir restricciones para acceder al dinero, control total sobre las finanzas, obligar a depender económicamente y destruir pertenencias personales.",
            "Involucran el control del dinero y los recursos, forzando la dependencia económica, destruyendo propiedades y limitando la autonomía financiera de la víctima."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaEconómica",
        "patterns": ["En qué lugares se da la violencia económica","Explícame los entornos donde ocurre la violencia económica","Dónde se da la violencia económica"],
        "responses": [
            "La violencia económica puede surgir en relaciones de pareja o familiares, donde se controlan los recursos financieros. También puede ocurrir en el ámbito laboral, manipulando las condiciones económicas de los empleados.",
            "Se da en relaciones de pareja o familiares, implicando control financiero y restricciones económicas. También puede ocurrir en el trabajo, afectando las condiciones laborales y salariales.",
            "La violencia económica ocurre en relaciones personales donde se limita el acceso al dinero. También se manifiesta en el trabajo, manipulando salarios y beneficios para controlar a los empleados."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaEconómica",
        "patterns": ["Cuáles son las causas más comunes de la violencia económica","Cuáles son las principales causas de la violencia económica","Causas de Violencia económica"],
        "responses": [
            "La violencia económica surge del deseo de control y dominación, perpetuación de roles de género tradicionales y falta de conciencia sobre los derechos económicos y la autonomía personal.",
            "Se debe al deseo de control, actitudes machistas y patriarcales, y falta de educación sobre derechos económicos, limitando la independencia financiera y perpetuando la dependencia.",
            "Las causas incluyen el deseo de ejercer poder y control, estereotipos de género arraigados y falta de conciencia sobre los derechos económicos, resultando en manipulación financiera y dependencia económica de la víctima."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaEconómica",
        "patterns": ["Cuáles son las consecuencias de la violencia económica","Háblame sobre las consecuencias de la violencia económica","Consecuencias económica"],
        "responses": [
            "Consecuencias de la violencia económica incluye dependencia financiera, pérdida de autonomía, estrés y ansiedad, limitación en oportunidades educativas y laborales.",
            "Puede llevar a dependencia financiera, ansiedad, limitación en acceso a recursos básicos y restringir las oportunidades educativas y laborales de la víctima.",
            "Resulta en pérdida de autonomía económica, estrés, dificultades para acceder a necesidades básicas y limitación en las opciones educativas y laborales, perpetuando la desigualdad y el ciclo de pobreza."
        ]
    },
    {
        "tag": "QuéEsViolenciaInstitucional",
        "patterns": ["Que es la violencia Institucional","Explicar violencia Institucional","Explicación de violencia Institucional","Descripción de violencia Institucional","Describir violencia Institucional","Significado de violencia Institucional","Concepto de violencia Institucional","Expresión de violencia Institucional","violencia Institucional"],
        "responses": [
            "La violencia institucional implica discriminación sistemática y abuso de poder por parte de estructuras como el gobierno o la policía, perpetuando desigualdades y violando derechos humanos.",
            "Se refiere a prácticas y políticas discriminatorias por instituciones como el gobierno o la policía, afectando especialmente a grupos vulnerables y limitando sus derechos y acceso a servicios.",
            "Es el abuso de poder por parte de instituciones, como el sistema educativo o de salud, que perpetúa desigualdades y vulnera los derechos humanos, afectando negativamente a personas en situaciones de vulnerabilidad."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaInstitucional",
        "patterns": ["Cuáles son los signos físicos de la violencia institucional","Háblame sobre los signos de violencia institucional","Explícame los signos de violencia institucional"],
        "responses": [
            "Signos de violencia institucional incluyen discriminación sistemática, negación de derechos, acceso desigual a servicios y tratamiento injusto hacia grupos vulnerables.",
            "Pueden ser políticas y prácticas discriminatorias, violaciones a derechos humanos, trato desigual y estigmatización de comunidades marginadas.",
            "Se manifiesta en la falta de acceso a servicios básicos, discriminación legal y social, así como en políticas que perpetúan desigualdades, indicando la presencia de violencia institucional."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaInstitucional",
        "patterns": ["En qué lugares se da la violencia institucional","Explícame los entornos donde ocurre la violencia institucional","Dónde se da la violencia institucional"],
        "responses": [
            "La violencia institucional puede darse en sistemas de justicia, salud, educación, fuerzas policiales y centros de detención, así como en organizaciones gubernamentales y sociales.",
            "Se encuentra en entornos como el sistema de justicia, salud, educación y fuerzas policiales, donde políticas y prácticas discriminan y vulneran derechos de personas y grupos.",
            "Ocurre en instituciones como sistemas de salud, educación y fuerzas policiales, donde políticas y actitudes perpetúan desigualdades y violan derechos, especialmente de individuos vulnerables."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaInstitucional",
        "patterns": ["Cuáles son las causas más comunes de la violencia institucional","Cuáles son las principales causas de la violencia institucional","Causas de Violencia institucional"],
        "responses": [
            "La violencia institucional se debe a actitudes discriminatorias, falta de rendición de cuentas, corrupción y sistemas sociales que perpetúan desigualdades y marginación.",
            "Sus causas incluyen actitudes discriminativas, falta de supervisión, corrupción y falta de educación sobre derechos humanos, lo que permite la perpetuación de violaciones de derechos por instituciones.",
            "Surge de actitudes discriminadoras arraigadas, falta de rendición de cuentas, corrupción y sistemas sociales que perpetúan desigualdades, creando un entorno propicio para la violencia institucional."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaInstitucional",
        "patterns": ["Cuáles son las consecuencias de la violencia institucional","Háblame sobre las consecuencias de la violencia institucional","Consecuencias institucional"],
        "responses": [
            "Consecuencias de la violencia institucional: violaciones a los derechos humanos, trauma, pérdida de confianza en las instituciones, marginalización social y dificultades para acceder a servicios.",
            "Pueden incluir violaciones a derechos humanos, pérdida de confianza en instituciones, desigualdad continua y dificultades para acceder a servicios básicos y oportunidades.",
            "Las consecuencias abarcan violaciones a derechos humanos, trauma, falta de confianza en instituciones, marginalización social y obstáculos para acceder a servicios y oportunidades, generando un ambiente de desconfianza y miedo."
        ]
    },
    {
        "tag": "ViolenciaDelPersonalDocenteHaciaMujeresyNiñas",
        "patterns": ["Qué se considera violencia del personal docente hacia mujeres y niñas en el contexto educativo","Qué significa la violencia de Docentes hacia las Mujeres y las Niñas","Violencia de docentes hacia mujeres y niñas","Explicame la Violencia de docentes hacia mujeres y niñas"],
        "responses": [
            "La violencia de personal docente hacia mujeres y niñas abarca abuso, acoso, discriminación o trato injusto en entornos educativos, perpetuando desigualdades y creando un ambiente hostil.",
            "Se refiere a cualquier forma de abuso o discriminación por parte de profesores hacia mujeres y niñas, incluyendo acoso verbal o físico, reforzando estereotipos y creando un entorno inseguro en la escuela.",
            "Es cualquier tipo de maltrato o discriminación perpetrado por personal docente hacia mujeres y niñas en contextos educativos, desde comentarios sexistas hasta agresiones, contribuyendo a un ambiente negativo y desigual."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaDePersonalDocenteHaciaMujeresYniñas",
        "patterns": ["Cuáles son algunos signos de violencia por parte del personal docente hacia mujeres y niñas","Háblame sobre los signos de violencia por parte de los docentes","Explícame los signos de violencia por parte de docentes","violencia por parte de docentes"],
        "responses": [
            "Signos de violencia de personal docente incluyen comentarios sexistas, humillación, discriminación académica, acoso verbal o físico, y estereotipos, creando un ambiente educativo hostil para mujeres y niñas.",
            "Pueden ser acoso verbal, discriminación en evaluaciones, comentarios sexistas o intimidación física por parte del personal docente, contribuyendo a un ambiente educativo inseguro para mujeres y niñas.",
            "Incluye comentarios sexistas, intimidación, discriminación en calificaciones y estereotipos de género por parte de profesores, generando un entorno educativo hostil y perjudicial para mujeres y niñas."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaDePersonalDocenteHaciaMujeresYniñas",
        "patterns": ["En qué lugares se da la violencia por parte del personal docente hacia mujeres y niñas","Explícame los entornos donde ocurre la violencia por parte del personal docente hacia mujeres y niñas","Dónde se da la violencia por parte del personal docente hacia mujeres y niñas","Dónde se genera la violencia por parte de docentes"],
        "responses": [
            "La violencia de personal docente hacia mujeres y niñas ocurre en escuelas, colegios y universidades, manifestándose en actitudes sexistas, acoso verbal o físico, discriminación académica y estereotipos de género.",
            "Se da en cualquier nivel educativo, donde profesores o personal docente perpetúan actitudes sexistas, acoso y discriminación, afectando el bienestar y el rendimiento de mujeres y niñas.",
            "Puede ocurrir en escuelas y universidades, implicando actitudes sexistas, acoso verbal o físico, y discriminación académica por parte del personal docente, generando un entorno educativo negativo para mujeres y niñas."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaDePersonalDocenteHaciaMujeresYniñas",
        "patterns": ["Cuáles son las causas más comunes de la violencia de docentes","Cuáles son las principales causas de la violencia por parte del personal docente hacia mujeres y niñas","Causas de Violencia de docentes hacia mujeres y niñas"],
        "responses": [
            "Las causas de violencia de personal docente, incluyen actitudes sexistas, desigualdades de poder, falta de capacitación en igualdad de género, impunidad y tolerancia cultural hacia ciertas formas de violencia.",
            "Sus causas de violencia de personal docente, incluyen actitudes discriminativas, falta de supervisión, corrupción y falta de educación sobre derechos humanos, lo que permite la perpetuación de violaciones de derechos por instituciones.",
            "Surge de actitudes discriminadoras arraigadas, falta de rendición de cuentas, corrupción y sistemas sociales que perpetúan desigualdades, creando un entorno propicio para la violencia institucional."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDePersonalDocenteHaciaMujeresYniñas",
        "patterns": ["Cuáles son las consecuencias de la violencia de docentes hacia mujeres y niñas","Háblame sobre las consecuencias de la violencia por parte de docentes hacia mujeres y niñas ","Consecuencias de docentes hacia mujeres y niñas"],
        "responses": [
            "Consecuencias: trauma emocional, baja autoestima, bajo rendimiento académico, deserción escolar y dificultades para establecer relaciones saludables en el futuro.",
            "Las consecuencias pueden incluir disminución de autoestima, pérdida de interés en el aprendizaje, trauma emocional y deserción escolar, afectando negativamente el bienestar y desarrollo personal.",
            "Consecuencias: trauma emocional, estigmatización, deserción escolar, perpetuación de estereotipos de género, impactando el desarrollo y bienestar a largo plazo de mujeres y niñas."
        ]
    },
    {
        "tag": "QuéEsViolenciaEnRazónDeGénero",
        "patterns": ["Que es la violencia en razon de género","Explicar violencia en razon de género","Explicación de violencia en razon de género","Descripción de violencia en razon de género","Describir violencia en razon de género","Significado de violencia en razon de género","Concepto de violencia en razon de género","Expresión de violencia en razon de género","violencia en razon de género"],
        "responses": [
            "Violencia de género es cualquier forma de abuso hacia una persona debido a su género, como violencia doméstica, acoso sexual y discriminación, causada por desigualdades de poder basadas en el género.",
            "Es el maltrato dirigido a una persona por su género, incluyendo violencia física, sexual o emocional, reflejando desigualdades de poder entre los géneros.",
            "La violencia de género engloba actos como violencia doméstica y acoso, causados por desigualdades sociales, culturales y económicas entre hombres y mujeres."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaEnRazónDeGénero",
        "patterns": ["Cuáles son los signos de violencia en razón de Género","Háblame sobre los signos de violencia en razón de Género","Explícame los signos de violencia en razón de Género","signos en razón de Género"],
        "responses": [
            "Signos de violencia de género incluyen control excesivo, amenazas, insultos, agresiones físicas o sexuales, manipulación económica y aislamiento social.",
            "Pueden implicar control, intimidación, insultos, agresiones físicas, restricción de libertad y manipulación económica, indicando una relación desigual basada en el género.",
            "Involucran control, amenazas, humillación, agresiones físicas o sexuales, y limitación de libertad, señalando desigualdades de poder en una relación debido al género."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaEnRazónDeGénero",
        "patterns": ["En qué lugares se da la violencia en razón del Género","Explícame los entornos donde ocurre la violencia en razón del Género","Dónde se da la violencia en razón del Género"],
        "responses": [
            "La violencia de género puede ocurrir en el hogar, relaciones de pareja, espacios públicos, lugares de trabajo y comunidades, perpetuando desigualdades de poder.",
            "Se da en el hogar, en la calle, en el trabajo y en instituciones educativas, reflejando desigualdades de género y control, afectando a mujeres y personas de géneros diversos.",
            "Ocurre en diversas situaciones como el hogar, relaciones íntimas, lugares públicos y el trabajo, marcada por desigualdades de poder y control, impactando negativamente a mujeres y personas de géneros diversos."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaEnRazónDeGénero",
        "patterns": ["Cuáles son las causas más comunes de la violencia en razón del Género","Cuáles son las principales causas de la violencia en razón del Género","Causas de Violencia en razón del Género"],
        "responses": [
            "Las causas incluyen desigualdades históricas, normas sociales, falta de educación sobre igualdad de género y factores económicos, perpetuando la violencia de género.",
            "Factores como estereotipos de género, desigualdades sociales y falta de conciencia sobre igualdad de género contribuyen a la violencia de género.",
            "La violencia de género se origina en normas culturales, desigualdades históricas y falta de educación, creando un entorno propicio para la perpetuación de esta violencia."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaEnRazónDeGénero",
        "patterns": ["Cuáles son las consecuencias de la violencia en razón del Género","Háblame sobre las consecuencias de la violencia en razón del Género","Consecuencias en razón del Género"],
        "responses": [
            "Consecuencias de la violencia en razón de género incluye lesiones físicas, daño emocional, problemas de salud mental, limitación de oportunidades educativas y laborales, perpetuación del ciclo de violencia y repercusiones sociales y económicas negativas.",
            "Pueden incluir lesiones, trauma emocional, desafíos de salud mental, pérdida de oportunidades educativas y laborales, y un impacto negativo en relaciones interpersonales y comunidades.",
            "Consecuencias: lesiones físicas y emocionales, desplazamiento, trastornos de salud mental, limitación de oportunidades educativas y laborales, y un impacto negativo en las relaciones y la equidad social."
        ]
    },
    {
        "tag": " ViolenciaEnElEntornoEscolar",
        "patterns": ["Que es la violencia entorno escolar","Explicar violencia entorno escolar","Explicación de violencia entorno escolar","Descripción de violencia entorno escolar","Describir violencia entorno escolar","Significado de violencia entorno escolar","Concepto de violencia entorno escolar","Expresión de violencia entorno escolar","violencia entorno escolar"],
        "responses": [ 
            "La violencia en el entorno escolar abarca agresiones, intimidación y discriminación dentro de las escuelas, causando daño emocional y afectando el rendimiento académico.",
            "Implica acoso, intimidación y abuso dentro de instituciones educativas, generando un ambiente negativo y afectando el bienestar emocional de estudiantes y personal.",
            "Incluye comportamientos agresivos, intimidación y discriminación en escuelas, creando un ambiente hostil y dañino que perjudica emocionalmente a estudiantes y maestros."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaEnElEntornoEscolar",
        "patterns": ["Cuáles son los signos de violencia en el entorno escolar","Háblame sobre los signos de violencia en el entorno escolar","Explícame los signos de violencia en el entorno escolar","signos en el entorno escolar"],
        "responses": [
            "Signos de violencia escolar incluyen cambios en el comportamiento, evitación de la escuela, aislamiento, lesiones inexplicables, problemas emocionales y señales de intimidación o acoso cibernético.",
            "Los signos pueden manifestarse como cambios en el rendimiento académico, aislamiento social, evitación de ciertas áreas, lesiones sin explicación, y comportamientos como insultos o intimidación.",
            "Signos de violencia escolar son cambios drásticos en el comportamiento, pérdida de interacción social, problemas emocionales, lesiones inexplicables y manifestaciones de acoso verbal o cibernético."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaEnElEntornoEscolar",
        "patterns": ["En qué lugares se da la violencia en el entorno escolar","Explícame los entornos donde ocurre la violencia en el entorno escolar","Dónde se da la violencia en el entorno escolar"],
        "responses": [
            "La violencia en el entorno escolar puede ocurrir en escuelas primarias, secundarias, preparatorias y universidades, incluyendo aulas, pasillos, patios y espacios digitales.",
            "Se manifiesta en instituciones educativas, como aulas y patios, e incluso en rutas de transporte escolar y áreas cercanas, involucrando estudiantes, maestros y personal.",
            "Puede darse en cualquier nivel educativo, desde escuelas primarias hasta universidades, y en diferentes espacios como aulas, patios y entornos digitales, implicando tanto a estudiantes como a profesores."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaEnElEntornoEscolar",
        "patterns": ["Cuáles son las causas más comunes de la violencia en el entorno escolar","Cuáles son las principales causas de la violencia en el entorno escolar","Causas de Violencia en el entorno escolar"],
        "responses": [
            "Las causas de la violencia en el entorno escolar incluyen desigualdades de poder, discriminación, influencia negativa de los medios y la falta de educación en valores y respeto.",
            "Factores como competencia excesiva, intolerancia, desigualdades sociales y falta de apoyo emocional contribuyen a la violencia en las escuelas.",
            "La violencia en el entorno escolar puede ser causada por influencias negativas, falta de educación en valores, desigualdades económicas y sociales, así como la falta de prevención y apoyo emocional adecuado."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaEnElEntornoEscolar",
        "patterns": ["Cuáles son las consecuencias de la violencia en el entorno escolar","Háblame sobre las consecuencias de la violencia en el entorno escolar","Consecuencias en el entorno escolar"],
        "responses": [
            "Las consecuencias de la violencia en el entorno escolar incluyen problemas emocionales, bajo rendimiento académico, deserción escolar y trastornos de ansiedad y depresión, creando un ambiente hostil en la escuela.",
            "Las consecuencias de la violencia en el entorno escolar pueden llevar a conflictos interpersonales, pérdida de confianza, problemas psicológicos y académicos, y contribuir a ciclos de violencia en la comunidad educativa.",
            "Las consecuencias de la violencia en el entorno escolar afectan a las víctimas con problemas emocionales y académicos, y también crean un ambiente hostil en la escuela, perpetuando la violencia y afectando a toda la comunidad educativa."
        ]
    },
    {
        "tag": " ViolenciaDeParejaOFamiliar",
        "patterns": ["Que es la violencia de pareja o familiar","Explicar violencia de pareja o familiar","Explicación de violencia de pareja o familiar","Descripción de violencia de pareja o familiar","Describir violencia de pareja o familiar","Significado de violencia de pareja o familiar","Concepto de violencia de pareja o familiar","Expresión de violencia de pareja o familiar","violencia de pareja o familiar"],
        "responses": [ 
            "La violencia de pareja o familiar involucra abuso físico, emocional, sexual o económico entre parejas o miembros familiares, afectando a personas de todas las edades y relaciones.",
            "La violencia de pareja o familiar es cualquier forma de abuso dentro de relaciones íntimas o familiares, incluyendo agresiones físicas, emocionales o sexuales, y puede afectar a parejas casadas, convivientes y otros miembros vulnerables de la familia.",
            "La violencia de pareja o familiar implica abuso físico, emocional, sexual o económico entre parejas o miembros de una familia, generando un ciclo de violencia que afecta negativamente a las víctimas y puede transmitirse a las generaciones futuras."    
        ]
    },
    {
        "tag": "CuálesSonLosSignosDeViolenciaDeParejaOFamiliar",
        "patterns": ["Cuáles son los signos de violencia de Pareja o Familiar","Háblame sobre los signos de violencia Pareja o Familiar","Explícame los signos de violencia Pareja o Familiar","signos de violencia de Pareja","signos de violencia Familiar"],
        "responses": [
            "Signos de violencia de pareja o familiar incluyen lesiones inexplicables, cambios de comportamiento, aislamiento social, control excesivo y amenazas verbales, indicando posibles situaciones de abuso.",
            "Signos de violencia de pareja o familiar pueden manifestarse como lesiones físicas, miedo constante, evitación de temas familiares, control financiero o cambios emocionales abruptos, sugiriendo posibles casos de violencia en la pareja o la familia.",
            "Signos de violencia de pareja o familiar incluyen aislamiento, control excesivo, manipulación emocional, amenazas verbales, cambios en el comportamiento y lesiones inexplicables, indicando situaciones de abuso en relaciones de pareja o familiares."    
        ]
    },
    {
        "tag": "DóndeSeDaLaViolenciaDeParejaOFamiliar",
        "patterns": ["En qué lugares se da la violencia de Pareja o Familiar","Explícame los entornos donde ocurre la violencia de Pareja o Familiar","Dónde se da la violencia de Pareja o Familiar"],
        "responses": [
            "La violencia de pareja o familiar puede ocurrir en cualquier lugar donde existan relaciones íntimas o familiares, como hogares, convivientes y entre padres e hijos, afectando a personas de todas las edades y contextos socioeconómicos.",
            "La violencia de pareja o familiar se da en hogares, relaciones de pareja, convivencias y relaciones entre padres e hijos, sin importar el entorno urbano o rural, y afecta a personas de diversos grupos demográficos.",
            "Ocurre en relaciones familiares y de pareja, tanto en entornos urbanos como rurales, y afecta a personas de todas las edades y niveles socioeconómicos, constituyendo un problema global."    
        ]
    },
    {
        "tag": "CuálesSonLasCausasDeViolenciaDeParejaOFamiliar",
        "patterns": ["Cuáles son las causas más comunes de la violencia de Pareja o Familiar","Cuáles son las principales causas de la violencia de Pareja o Familiar","Causas de Violencia de Pareja o Familiar"],
        "responses": [
            "Las causas de la violencia de pareja o familiar incluyen desigualdades de poder, baja autoestima, modelos de comportamiento aprendidos, estrés y factores socioeconómicos, creando un ciclo de violencia.",
            "Factores como control, consumo de sustancias, problemas de salud mental y normas sociales contribuyen a la violencia de pareja o familiar, perpetuando un ciclo de abuso.",
            "La violencia de pareja o familiar se relaciona con desigualdades de género, baja autoestima, estrés y factores socioeconómicos, creando un entorno propicio para la violencia en las relaciones familiares o de pareja."
        ]
    },
    {
        "tag": "CuálesSonLasConsecuenciasDeViolenciaDeParejaOFamiliar",
        "patterns": ["Cuáles son las consecuencias de la violencia de Pareja o Familiar","Háblame sobre las consecuencias de la violencia de Pareja o Familiar","Consecuencias de Pareja o Familiar"],
        "responses": [
            "Las consecuencias de la violencia de pareja o familiar incluyen lesiones físicas y emocionales, trauma, trastornos de salud mental, aislamiento social y pueden afectar negativamente las relaciones interpersonales.",
            "La violencia de pareja o familiar Pueden provocar baja autoestima, depresión, ansiedad, desconfianza en las relaciones y problemas físicos y mentales a largo plazo, generando un impacto profundo en la vida de las víctimas.",
            "La violencia de pareja o familiar tiene consecuencias graves como lesiones, trauma emocional, trastornos mentales, aislamiento social y afecta la calidad de las relaciones, perpetuando ciclos de abuso en generaciones futuras."
        ]
    },
    
    {
        "tag": "QueEsLesionesPersonalesDolosas",
        "patterns": ["Qué es Lesiones Personales Dolosas","Explicar Lesiones Personales Dolosas","Explicación de Lesiones Personales Dolosas","Descripción de Lesiones Personales Dolosas","Describir Lesiones Personales Dolosas","Significado de Lesiones Personales Dolosas","Concepto de Lesiones Personales Dolosas","Expresión de Lesiones Personales Dolosas","Lesiones Personales Dolosas"],
        "responses": [
            "Las lesiones personales dolosas son daños físicos causados intencionalmente a otra persona.",
            "Pueden derivar de agresiones físicas, peleas o actos violentos deliberados.",
            "En muchos sistemas legales, las lesiones personales dolosas pueden dar lugar a sanciones penales contra el agresor."
        ]
    },

    {
        "tag": "TiposDeLesionesPersonalesDolosas",
        "patterns": ["tipos de Lesiones Personales Dolosas","Tipos de Lesiones Personales Dolosas","clases de Lesiones Personales Dolosas","clases tipo de Lesiones Personales Dolosas","clases de Lesiones Personales Dolosas","Categorias de Lesiones Personales Dolosas","Cualidades de Lesiones Personales Dolosas"],
        "responses": [
            "Lesiones personales dolosas son daños corporales causados intencionalmente.",
            "Pueden incluir desde agresiones menores hasta intentos de homicidio.",
            "La intención de causar daño es un factor clave en estos casos"
        ]
    },
    {
        "tag": "EjemploLesionesPersonalesDolosas",
        "patterns": ["Ejemplos de Lesiones Personales Dolosas"],
        "responses": [
            "Agresión simple: Un individuo golpea a otro durante una pelea en un bar. \n Lesiones graves o agravadas: Un ladrón ataca a una víctima con un cuchillo durante un robo, causando heridas graves. \n Intento de homicidio: Un individuo dispara un arma de fuego con la intención de matar a otra persona, pero la víctima sobrevive al ataque"
        ]
    },
     {
        "tag": "PenaPersonalesDolosas",
        "patterns": ["Cuál es la pena por cometer lesiones personales dolosas","Qué consecuencia implica cometer lesiones personales dolosas","Cuáles son las sanciones por perpetrar lesiones personales dolosas","Cuál es el castigo por lesiones personales dolosas","Qué pena se asigna a quienes cometen lesiones personales dolosas","Qué repercusiones legales existen para quienes realizan lesiones personales dolosas"],
        "responses": [
            "Las penas por lesiones personales dolosas varían según la gravedad del delito y la jurisdicción.",
            "Pueden incluir multas, prisión, libertad condicional y servicio comunitario.",
            "La legislación específica depende del lugar, por lo que es importante consultar a un abogado local para obtener información detallada sobre las penas."
        ]
    },
    {
        "tag": "VictimaLesionesPersonalesDolosas",
        "patterns": ["Cuáles son las acciones que debe tomar una víctima de lesiones personales dolosas","Qué debo hacer una víctima de lesiones personales dolosas","Cuál es el procedimiento adecuado para una víctima de lesiones personales dolosas","Qué medidas son necesarias para una persona afectada por lesiones personales dolosas","Qué acciones se recomiendan a alguien que ha sufrido lesiones personales dolosas","victima lesiones personales dolosas"],
        "responses": [
            "Si eres víctima de lesiones personales solodolas, sigue estos pasos: \n Busca un lugar seguro. \n Llama a la policía en caso de peligro inmediato. \n Busca ayuda de organizaciones de apoyo a víctimas de violencia. \n Considera obtener una orden de restricción si es necesario. \n Habla con un terapeuta o consejero para recibir apoyo emocional. \n Denuncia los incidentes a las autoridades si te sientes segura para hacerlo. \n Conoce tus derechos legales y busca asesoramiento legal si es necesario. \n Comunica la situación a amigos y familiares de confianza. \n Planifica tu seguridad a largo plazo y considera un refugio o apoyo legal para una separación segura si es necesario. \n Mantén un registro de los incidentes de violencia para futuras referencias."
        ]
    },
    

    {
        "tag": "desconocido",
        "patterns": ["*"],
        "responses": [
            "Lo siento, no te entiendo. ¿Podrías preguntar algo relacionado con la violencia basada en género?",
            "Parece que estoy un poco confundido con eso.¿Podrías preguntar algo relacionado con la violencia basada en género?",
            "No estoy seguro de entender. ¿Podrías proporcionar más detalles o hablar algo relacionado con violencia basada en género ?",
            "Mis conocimientos son limitados y puede que no pueda ayudarte con eso en particular."
            
        ]
    }

    

    
    
    

]
}