{
    "intents": [
        {
            "tag": "Saludo",
            "patterns": ["Hola", "que tal","Que haces","como estas"],
            "responses": [
                "¡Hola! Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
                "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia de género. ¿Cómo puedo asistirte?"
            ]
        },

        {
            "tag": "buenosDias",
            "patterns": ["Buenos días"],
            "responses": [
                "Buenos dias, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
                "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
                "Buenos días. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
            ]
        },
        {
            "tag": "buenasTardes",
            "patterns": ["Buenos tardes"],
            "responses": [
                "Buenas tardes, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
                "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
                "Buenas tardes. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
            ]
        },
        {
            "tag": "buenasNoches",
            "patterns": ["Buenas noches"],
            "responses": [
                "Buenos Noches, Soy un chatbot dedicado a proporcionarte información y apoyo relacionado con la violencia basada en género. ¿En qué puedo ayudarte hoy?",
                "¡Saludos! Estoy aquí para ayudarte con información sobre la violencia basada en género. ¿Cómo puedo asistirte?",
                "Buenos Noches. Soy un chatbot especializado en temas de violencia basada en género. ¿En qué puedo orientarte?"
            ]
        },
        {
            "tag": "Despedida",
            "patterns": ["Adiós", "Hasta luego",	"chao"],
            "responses": [
                "De nada, si tienes más preguntas en el futuro, no dudes en preguntar. ¡Cuídate!",
                "Hasta luego. Siempre estoy aquí si necesitas más información o apoyo.",
                "No hay problema, estoy disponible para ayudarte en cualquier momento. ¡Adiós!"
            ]
        },
        {
            "tag": "Agradecimiento",
            "patterns": ["Gracias por la ayuda", "Te agradezco", "Estoy agradecido","Gracias"],
            "responses": [
                "No hay de qué, siempre estoy aquí para ayudar. Si tienes más preguntas, no dudes en preguntar.",
                "De nada, es un placer ayudarte. No dudes en contactarme si necesitas más información.",
                "¡Gracias por tu agradecimiento! Estoy disponible para responder tus preguntas en cualquier momento."
            ]
        },
        {
            "tag": "No_entendido",
            "patterns": ["No entiendo", "No sé qué hacer", "Confundido"],
            "responses": [
                "Entiendo que puedas sentirte confundido. Estoy aquí para proporcionarte información relacionado con violencia basada en género. ¿En qué puedo aclararte las dudas?",
                "No te preocupes si no entiendes algo. Estoy aquí para ayudarte a obtener la información relacionado con violencia basada en género que necesitas.",
                "Si te sientes confundido, no dudes en preguntar más. Estoy aquí para aclarar tus dudas."
            ]
        },
        {
            "tag": "Informativo",
            "patterns": ["Cuéntame más", "Más información", "Explícame"],
            "responses": [
                "Claro, puedo proporcionarte información sobre la violencia basada en género, sus tipos y cómo buscar ayuda. ¿En qué tema específico estás interesado?",
                "Estoy aquí para proporcionarte información detallada sobre la violencia basada en género. ¿Sobre qué aspecto te gustaría saber más?",
                "¡Claro! Si deseas más información sobre la violencia basada en género, no dudes en preguntar. Estoy aquí para ayudarte."
            ]
        },
        
        {
            "tag": "QueEsSexo",
            "patterns": ["Qué es sexo","Explicar sexo","Explicación de sexo","Descripción de sexo","Describir sexo","Significado de sexo","Concepto de sexo","Expresión de sexo","sexo"],
            "responses": [
                "El sexo es la combinación de características biológicas que distingue a los seres humanos como masculinos o femeninos.",
                "El sexo se refiere a las diferencias físicas y fisiológicas entre hombres y mujeres, como los genitales y las características sexuales secundarias.",
                "El sexo se refiere a las características físicas y biológicas que distinguen a hombres y mujeres."
            ]
        },
        
        {
            "tag": "DiferenciaEntreSexoYGenero",
            "patterns": ["diferencia entre sexo y género", "distinción entre sexo y género","distingue sexo y género","Es lo mismo sexo y género","sexo y género"],
            "responses": [
                "Sexo se refiere a las características biológicas, como genitales y cromosomas, que clasifican a una persona como hombre o mujer. Género se relaciona con las identidades, roles y expresiones sociales y personales asociadas a la feminidad y la masculinidad.",
                "Sexo es biológico y se asigna al nacer, mientras que género es una construcción social y personal que puede variar de una cultura a otra.",
                "El sexo se refiere a lo que naces (biología) y el género se refiere a quién eres (identidad y expresión)."
            ]
        },
        
        {
            "tag": "TiposDeSexo",
            "patterns": ["tipos de sexo","clase de sexo","Categorias de sexo","Cualidades de sexo"],
            "responses": [
                "Es la clasificación de los seres humanos en machos y hembras basada en características físicas y genéticas"
            ]
        },
        
        {
            "tag": "QueEsElGenero",
            "patterns": ["Qué es género","Explicación de género","Descripción de género","Describir género","Significado de género","Concepto de género","Expresión de género","género"],
            "responses": [
                "El género es la identidad personal de una persona relacionada con su sentido de ser hombre, mujer u otra identidad.",
                "El género se refiere a cómo una persona se identifica en términos de masculino, femenino o cualquier otra identidad de género.",
                "El género es la expresión social de la identidad de una persona en relación con las expectativas culturales de la feminidad y la masculinidad."
            ]
        },
        {
            "tag": "QueEsElGeneroBinario",
            "patterns": ["Qué es género binario","Explicar género binario","Explicación de género binario","Descripción de género binario","Describir género binario","Significado de género binario","Concepto de género binario","Expresión de género binario","género binario"],
            "responses": [
                "Género binario: Masculino y femenino.",
                "Tradicionalmente, se ha considerado que son las únicas dos identidades de género que son femenino y msaculino."
                
            ]
        },
        
        {
            "tag": "DiferenciaEntreGeneroYIdentidadDeGenero",
            "patterns": ["diferencia entre sexo y género", "distinción entre sexo y género","distingue sexo de género","Es lo mismo sexo y género","género y identidad de género"],
            "responses": [
                "Género es las expectativas sociales de ser hombre o mujer y identidad de Género es cómo una persona se identifica.",
                "Diferencia de género se refiere a las normas y roles sociales asociados a ser masculino o femenino, mientras que la identidad de género es la forma en que una persona se siente y se identifica en términos de género."
            ]
        },
        
        {
            "tag": "QueEsEstereotiposDeGenero",
            "patterns": ["Qué es estereotipos de género","Explicación de estereotipos de género","Descripción de estereotipos de género","Describir estereotipos de género","Significado de estereotipos de género","Concepto de estereotipos de género","Expresión de estereotipos de género","estereotipos de Género"],
            "responses": [
                "Los estereotipos de género son imaginarios o expectativas de comportamiento que parten de la comprensión social de las diferencias físicas, biológicas o sexuales entre hombres y mujeres",
                "Los estereotipos de género son creencias preconcebidas sobre cómo se espera que se comporten, piensen y sientan las personas en función de su género."
            ]
        },
        
        {
            "tag": "TiposDeGenero",
            "patterns": ["tipos de género","Tipos de identidad de género","clases de genero","clases tipo de genero de género","clases de género","Categorias de género","Cualidades de género"],
            "responses": [
                "Se refieren a las diferentes identidades de género que van más allá de la dicotomía tradicional hombre/mujer. Algunos ejemplos incluyen: hombre, mujer, transgénero, género no binario, género fluido, genderqueer, agénero, bigénero, tercer género y dos espíritus."
            ]
        },
        {
            "tag": "QuéEsViolenciaDeGénero",
            "patterns": ["qué es la violencia de género","Explicar violencia de género","Explicación de violencia de género","Descripción de violencia de género","Describir violencia de género","Significado de violencia de género","Concepto de violencia de género","Expresión de violencia de género","violencia de género" ],
            "responses": [
                "La violencia de género se refiere a cualquier acto o conducta que causa daño físico, sexual o psicológico a una persona debido a su género.",
                "La Violencia de Género es cualquier maltrato específico hacia alguien debido a su género, usualmente mujeres, involucrando violencia física, sexual o psicológica para ejercer poder y control.",
           			"La violencia de género se define como cualquier acto violento o abusivo que se dirige específicamente contra alguien debido a su género."
           ]
        },
        {
            "tag": "QuéEsViolenciaBasadaEnGénero",
            "patterns": ["qué es la violencia basada en género","Explicación de violencia basada en género","Descripción de violencia basada en género","Describir violencia basada en género","Significado de violencia basada en género","Concepto de violencia basada en género","Expresión de violencia basada en género","violencia basada en género","Explicación de VBG","Descripción de VBG","Describir VBG","Significado de VBG","Concepto de VBG","Expresión de VBG","VBG" ],
            "responses": [
                "Violencia basada en género es cualquier forma de violencia que ocurre debido a las diferencias de género y las normas sociales que perpetúan la desigualdad entre hombres y mujeres.",
                "Violencia basada en género es la violencia que se comete contra alguien debido a su género, afectando a personas de todas las identidades de género, pero que afecta principalmente a mujeres y niñas debido a las estructuras patriarcales.",
           			"Violencia basada en género es cualquier actos de violencia, como física, sexual o emocional, que se perpetúan debido a las normas y expectativas sociales sobre el comportamiento apropiado para cada género."
           ]
        },
        {
            "tag": "DiferenciaViolenciaBasadaEnGéneroYViolenciaDeGenero",
            "patterns": ["diferencia entre violencia basada en género y violencia de género", "distinción entre violencia basada en género y violencia de género","En qué se distingue violencia basada en género y violencia de género","Es lo mismo violencia basada en género y violencia de género","violencia basada en género y violencia de género","Es igual violencia basada en género y violencia de género","Cuál es la diferencia entre vbg y violencia de género", "distinción entre vbg y violencia de género","En qué se distingue vbg y violencia de género","Es lo mismo VBG y violencia de género","VBG y violencia de género","Es igua VBG y violencia de género"],
            "responses": [
                "Violencia de género se enfoca en la violencia que afecta a una persona debido a su género, generalmente mujeres víctimas de violencia por parte de hombres. Violencia basada en género (VBG) es un término más amplio que incluye cualquier violencia que se perpetra debido a las diferencias de género.",
                "La violencia de género se dirige específicamente a las personas debido a su género, mientras que la violencia basada en género incluye la violencia que puede afectar a alguien debido a su identidad de género, orientación sexual u otras características relacionadas con el género.",
           		"La violencia de género se centra en la desigualdad de género y la opresión de las mujeres, mientras que la violencia basada en género reconoce que las personas de todos los géneros pueden ser víctimas de violencia relacionada con las normas de género y roles sociales."
           ]
        },
                
        

        {
            "tag": "QueEsLaOrientacionSexual",
            "patterns": ["Qué es la orientación sexual","Explicación de orientación sexual","Descripción de orientación sexual","Describir orientación sexual","Significado de orientación sexual","Concepto de orientación sexual","Expresión de orientación sexual","orientacion orientación sexual"],
            "responses": [
                "La orientación sexual se refiere a quiénes sentimos atracción emocional y sexual. Puede ser heterosexual, homosexual, bisexual, o de otras formas.",
                "La orientación sexual es a quiénes nos sentimos atraídos: del mismo sexo, del sexo opuesto, o de ambos sexos. Es una parte fundamental de nuestra identidad.",
                "La orientación sexual es sobre hacia quiénes sentimos atracción: hombres, mujeres, ambos o ninguno. Define nuestras preferencias románticas y sexuales."
            ]
        },
        {
            "tag": "CuantasOrientacionesSexuales",
            "patterns": ["Cuántas orientaciones sexuales existen", "cuantas orientaciones sexuales","tipos orientaciones sexuales", "clases de orientaciones sexuales","Categorias de orientaciones sexuales","Cualidades de orientaciones sexuales" ],
            "responses": [
                "Existen numerosas orientaciones sexuales, incluyendo heterosexualidad, homosexualidad, bisexualidad, pansexualidad y asexualidad, entre otras.",
                "No hay una lista fija de orientaciones sexuales, ya que las experiencias son diversas. Sin embargo, algunas comunes son heterosexual, homosexual y bisexual, pero existen muchas más, como pansexual, asexual y demisexual.",
                "La diversidad en las orientaciones sexuales es amplia y va más allá de las categorías básicas. Además de heterosexual, homosexual y bisexual, hay identidades como pansexual, queer, asexual, entre otras, que reconocen la diversidad de las experiencias humanas."
            ]
        },
        
        {
            "tag": "heterosexualidad",
            "patterns": ["Qué es la heterosexualidad","Explicar heterosexualidad","Explicación de heterosexualidad","Descripción de heterosexualidad","Describir heterosexualidad","Significado de heterosexualidad","Concepto de heterosexualidad","Expresión de heterosexualidad","heterosexualidad","heterosexual"],
            "responses": [
                "Heterosexualidad es la orientación sexual en la que una persona siente atracción romántica y sexual hacia personas del sexo opuesto.",
                "Heterosexualidad es cuando una persona se siente atraída emocional y sexualmente por individuos del género opuesto al suyo.",
                "La heterosexualidad es la orientación sexual común en la cual una persona se siente atraída romántica y sexualmente hacia personas del sexo contrario."
            ]
        },
        {
            "tag": "Homosexualidad",
            "patterns": ["Qué es la Homosexualidad","Explicar Homosexualidad","Explicación de Homosexualidad","Descripción de Homosexualidad","Describir Homosexualidad","Significado de Homosexualidad","Concepto de Homosexualidad","Expresión de Homosexualidad","Homosexualidad","homosexual"],
            "responses": [
                "Homosexualidad es la orientación sexual en la que una persona siente atracción romántica y sexual hacia personas del mismo sexo.",
                "Homosexualidad es cuando alguien se siente atraído emocional y sexualmente por individuos del mismo género.",
                "La homosexualidad es la orientación sexual en la que una persona experimenta atracción romántica y sexual hacia personas de su mismo sexo."
            ]
        },
        {
            "tag": "Bisexualidad",
            "patterns": ["Qué es la bisexualidad ","Explicar bisexualidad","Explicación de bisexualidad","Descripción de bisexualidad","Describir bisexualidad","Significado de bisexualidad","Concepto de bisexualidad","Expresión de bisexualidad","bisexualidad","bisexual"],
            "responses": [
                "La bisexualidad es una orientación sexual en la que una persona se siente atraída emocional, romántica y/o sexualmente hacia individuos de más de un género, lo que puede incluir géneros masculinos, femeninos y no binarios.",
                "La bisexualidad se refiere a la capacidad de una persona para experimentar atracción tanto hacia personas del mismo género como del género opuesto. Las personas bisexuales tienen la capacidad de establecer relaciones románticas y sexuales con individuos de diferentes identidades de género.",
                "La bisexualidad es una orientación sexual diversa y variada en la que las personas se sienten atraídas por una amplia gama de géneros, sin importar si son hombres, mujeres, o identidades de género no binarias. Esta atracción puede ser emocional, romántica y/o sexual, y varía en intensidad y preferencia de una persona a otra."
            ]
        },
        {
            "tag": "Pansexualidad",
            "patterns": ["Qué es la pansexualidad","Explicar pansexualidad","Explicación de pansexualidad","Descripción de pansexualidad","Describir pansexualidad","Significado de pansexualidad","Concepto de pansexualidad","Expresión de pansexualidad","pansexualidad","pansexual"],
            "responses": [
                "La pansexualidad es la atracción hacia personas sin importar su género, incluyendo hombres, mujeres, y personas con identidades de género no binarias",
                "La pansexualidad implica sentir atracción romántica, emocional y sexual hacia individuos independientemente de su identidad de género.",
                "La pansexualidad se caracteriza por la capacidad de sentir atracción por personas de todos los géneros, sin restricciones basadas en la identidad de género."
            ]
        },
       
        {
            "tag": "Asexualidad",
            "patterns": ["Qué es asexualidad","Explicar asexualidad","Explicación de asexualidad","Descripción de asexualidad","Describir asexualidad","Significado de asexualidad","Concepto de asexualidad","Expresión de asexualidad","asexualidad","asexual"],
            "responses": [
                "La asexualidad es una orientación sexual en la cual una persona no experimenta atracción sexual hacia otras personas.",
                "La asexualidad es la falta de interés o deseo sexual hacia cualquier género o individuo. Las personas asexuales pueden experimentar conexiones emocionales y románticas, pero no sienten necesidad de actividad sexual.",
                "La asexualidad es una identidad sexual en la que alguien no siente atracción sexual hacia nadie. Las personas asexuales pueden tener relaciones íntimas y emocionales, pero el componente sexual no es una parte fundamental de su orientación."
            ]
        },
        {
            "tag": "Demisexualidad",
            "patterns": ["Qué es demisexualidad","Explicar demisexualidad","Explicación de demisexualidad","Descripción de demisexualidad","Describir demisexualidad","Significado de demisexualidad","Concepto de demisexualidad","Expresión de demisexualidad","demisexualidad","demisexual"],
            "responses": [
                "La demisexualidad es la atracción sexual que se desarrolla solo después de establecer una conexión emocional fuerte con alguien.",
                "La demisexualidad implica sentir atracción sexual solo cuando existe un lazo emocional profundo con la persona.",
                "La demisexualidad se caracteriza por experimentar atracción sexual después de formar una conexión emocional significativa con alguien en particular."
            ]
        },
        {
            "tag": "Graysexualidad",
            "patterns": ["Qué es la graysexualidad","Explicar graysexualidad","Explicación de graysexualidad","Descripción de graysexualidad","Describir graysexualidad","Significado de graysexualidad","Concepto de graysexualidad","Expresión de graysexualidad","graysexualidad","graysexual"],
            "responses": [
                "La graysexualidad es una orientación sexual en la que una persona experimenta atracción sexual en raras ocasiones o en circunstancias específicas.",
                "La graysexualidad se refiere a alguien que experimenta atracción sexual de forma ocasional, fluctuante o en intensidad limitada.",
                "La graysexualidad es una identidad sexual donde la atracción sexual es variable, no siendo ni completamente asexual ni plenamente sexual."
            ]
        },
        {
            "tag": "OrientacionSexualFluctuante",
            "patterns": ["Qué es la orientación sexual fluctuante","Explicar orientación sexual fluctuante","Explicación de orientación sexual fluctuante","Descripción de orientación sexual fluctuante","Describir orientación sexual fluctuante","Significado de orientación sexual fluctuante","Concepto de orientación sexual fluctuante","Expresión de orientación sexual fluctuante","orientación sexual fluctuante"],
            "responses": [
                "La orientación sexual fluctuante se refiere a la capacidad de una persona para experimentar cambios en su atracción sexual a lo largo del tiempo.",
                "Es cuando una persona experimenta variaciones en su atracción hacia diferentes géneros en momentos diferentes, sin adherirse a una orientación fija.",
                "La orientación sexual fluctuante implica que una persona puede sentirse atraída por diferentes géneros en distintas etapas de su vida o en situaciones emocionales cambiantes."
            ]
        },
        {
            "tag": "QueEsLaIdentidadDeGenero",
            "patterns": ["Qué es la identidad de género","Explicación de dentidad de género","Descripción de dentidad de género","Describir dentidad de género","Significado de dentidad de género","Concepto de dentidad de género","Expresión de dentidad de género","identidad de género"],
            "responses": [
                "La identidad de género es la experiencia interna y profunda de ser hombre, mujer, o una identidad de género diferente. No siempre coincide con el sexo asignado al nacer.",
                "Es la percepción interna de uno mismo como hombre, mujer, ambos, ninguno o un género diferente al asignado al nacer. La identidad de género no se limita a las categorías tradicionales de masculino o femenino.",
                "La identidad de género es cómo una persona se identifica y se siente respecto a su género, lo cual puede ser masculino, femenino, o cualquier otra identidad de género con la que se identifique. Es una experiencia única para cada individuo."
            ]
        },
        {
            "tag": "QueEsLgbtiq",
            "patterns": ["Qué es lgbtiq","Explicación de lgbtiq","Descripción de lgbtiq","Describir lgbtiq","Significado de lgbtiq","Concepto de lgbtiq","Expresión de lgbtiq","lgbtiq+","lgbtiq","lgbti","lgbt","lgb"],
            "responses": [
                "LGBTIQ+ es un acrónimo que representa a lesbianas, gays, bisexuales, personas transgénero, intersexuales y el símbolo de más (+) denota inclusión para otras identidades sexuales y de género.",
                "LGBTIQ+ es un término inclusivo que abarca diversas orientaciones sexuales y identidades de género, como lesbianas, gays, bisexuales, personas transgénero, intersexuales y otras identidades no conformes con las normas tradicionales.",
                "LGBTIQ+ representa una comunidad diversa, incluyendo a personas lesbianas, gays, bisexuales, transgénero, intersexuales y otras identidades sexuales y de género, mostrando el compromiso con la inclusión de todas las orientaciones y expresiones de género."
            ]
        },
        {
            "tag": "PersonasLesbianas",
            "patterns": ["Qué es una persona lesbiana","Explicación de lesbiana","Descripción de lesbiana","Describir lesbiana","Significado de lesbiana","Concepto de lesbiana","Expresión de lesbiana","lesbiana"],
            "responses": [
                "Lesbianas son mujeres que tienen atracción romántica, emocional y/o sexual hacia otras mujeres.",
                "El término lesbianas se refiere a mujeres homosexuales, es decir, mujeres que tienen relaciones románticas y sexuales con otras mujeres.",
                "Lesbianas son mujeres que se sienten atraídas emocional y sexualmente por personas del mismo sexo, y se identifican como parte de la comunidad LGBTQ+."
            ]
        },
        {
            "tag": "PersonasGays",
            "patterns": ["Qué es Persona gay","Explicación de gay","Descripción de gay","Describir gay","Significado de gay","Concepto de gay","Expresión de gay", "gay"],
            "responses": [
                "Gays son hombres que tienen atracción romántica, emocional y/o sexual hacia otros hombres.",
                "El término gays se refiere a hombres homosexuales, es decir, hombres que tienen relaciones románticas y sexuales con otros hombres.",
                "Gays son hombres que se sienten atraídos emocional y sexualmente por personas del mismo sexo."
            ]
        },
        {
            "tag": "Transgenero",
            "patterns": ["Qué es Persona Transgénero","Explicación de Transgénero","Descripción de Transgénero","Describir Transgénero","Significado de Transgénero","Concepto de Transgénero","Expresión de Transgénero","Transgénero"],
            "responses": [
                "Transgénero es un término que se refiere a personas cuya identidad de género difiere del sexo asignado al nacer.",
                "Transgénero describe a individuos cuya identidad de género no coincide con el género que se les asignó al nacer, y pueden tomar medidas para vivir de acuerdo con su identidad de género.",
                "Personas transgénero son aquellas cuya experiencia interna de género es diferente de la que se les asignó al nacer, y pueden identificarse como hombre, mujer, o con una identidad de género no binaria, entre otras identidades."
            ]
        },{
            "tag": "Intersexual",
            "patterns": ["Qué es Intersexual","Explicación de Intersexual","Descripción de Intersexual","Describir Intersexual","Significado de Intersexual","Concepto de Intersexual","Expresión de Intersexual", "Intersexual"],
            "responses": [
                "Intersexual es un término que se refiere a personas que nacen con características sexuales que no se ajustan típicamente a las definiciones de sexo masculino o femenino.",
                "Las personas intersexuales tienen variaciones biológicas en sus características sexuales, como genitales, cromosomas o hormonas, que no se alinean claramente con las definiciones tradicionales de masculino o femenino.",
                "Intersexual es un estado biológico en el que una persona presenta diferencias en su anatomía sexual, lo que puede incluir genitales ambivalentes o variaciones en los cromosomas sexuales, haciendo que no se clasifiquen fácilmente como exclusivamente masculinos o femeninos."
            ]
        },

        {
            "tag": "DiferenciaEntreOrientaciónSexualYIdentidadDeGenero",
            "patterns": ["diferencia entre orientación sexual y identidad de género", "distinción entre orientación sexual y identidad de género","es lo mismo orientación sexual y identidad de género","orientación sexual y identidad de género"],
            "responses": [
                "La orientación sexual se trata de a quiénes sentimos atracción, como hombres, mujeres o ambos. La identidad de género es quiénes creemos ser en términos de género, como hombre, mujer o no binario.",
                "La orientación sexual se refiere a quiénes amamos y nos sentimos atraídos, mientras que la identidad de género es cómo nos identificamos internamente como hombre, mujer, u otra identidad de género.",
                "La orientación sexual se centra en a quiénes encontramos atractivos, mientras que la identidad de género se trata de quiénes somos en términos de nuestro sentido interno de ser hombre, mujer, o una identidad de género no binaria."
            ]
        }
        ,
        {
            "tag": "RecursosAyuda",
            "patterns": ["encontrar ayuda", "encontrar recursos","que hago si soy victiva"],
            "responses": [
                "Si eres víctima de violencia de género o conoces a alguien que lo es, puedes comunicarte con líneas de ayuda como [número de teléfono] para recibir apoyo confidencial.",
                
                "Organizaciones como [nombres de organizaciones] también proporcionan recursos y orientación para ayudar a las víctimas a salir de situaciones abusivas.",
                "Es importante buscar apoyo y hablar sobre la situación para poder tomar medidas para tu seguridad y bienestar."
            ]
        }
        ,
        {
            "tag": "PerspectivaDeDerechos",
            "patterns": ["Perspectiva de Derechos"],
            "responses": [
                "La perspectiva de derechos reconoce a las personas como titulares activas de derechos civiles, políticos, económicos, sociales y culturales, que son universales e interdependientes.",
                "Los derechos son indivisibles, universales e irrenunciables, reconociendo a las personas como ciudadanas libres con un conjunto completo de derechos."
                ]
        }
        ,
        {
            "tag": "PerspectivaDeGénero",
            "patterns": ["Perspectiva de Género"],
            "responses": [
                "La perspectiva de género es una herramienta que destaca las desigualdades entre hombres y mujeres, incluyendo a personas con diversas identidades y orientaciones de género que enfrentan discriminación por cuestionar las normas heteronormativas y binarias de género.",
                "La perspectiva de género revela desigualdades en las relaciones entre hombres y mujeres, reconociendo también a personas con identidades y orientaciones de género diversas que desafían las normas tradicionales de género, lo que a menudo resulta en discriminación."
                ]
        }

        ,
        {
            "tag": "QueEsViolencia ",
            "patterns": ["Qué es violencia","Explicar violencia","Explicación de violencia","Descripción de violencia","Describir violencia","Significado de violencia","Concepto de violencia","Expresión de violencia","violencia"],
            "responses": [
                "Violencia es dañar a otros física o emocionalmente",
                "Violencia es el uso de la fuerza para lastimar a alguien."
                
                ]
        }
        ,
        {
            "tag": "TiposDeViolencia ",
            "patterns": ["tipos de violencia","clases de Violencia","Categorias de violencia","Cualidades de violencia"],
            "responses": [
                "Los tipos de violencia se refieren a las categorías o formas en que se manifiesta la agresión, el abuso o la coerción hacia otras personas o grupos. Estos tipos pueden incluir, entre otros, violencia física, psicológica, sexual y verbal.",
                "Los tipos de violencia son las diversas formas en que se ejerce el poder o control de manera que daña a otra persona, ya sea mediante el uso de fuerza física, abuso emocional, explotación sexual, discriminación u opresión."
                ]
        }
        ,
        {
            "tag": "ConsecuenciasDeViolencia",
            "patterns": ["Consecuencias de violencia","efectos de violencia","secuela deviolencia","Derivación de violencia"],
            "responses": [
            	"La violencia puede causar problemas de salud mental, como ansiedad y depresión.",
                "La violencia puede causar lesiones físicas y emocionales, perpetuar un ciclo de abuso generacional y llevar al aislamiento social y problemas legales."

                ]
        }
        ,
        {
            "tag": "CausasDeViolencia",
            "patterns": ["causa de violencia","Motivos de violencia","Razones de violencia","factores de violencia","casos de violencia"],
            "responses": [
                "La disparidad en la distribución de recursos y oportunidades puede generar frustración y resentimiento, lo que a menudo desencadena actos violentos.",
                "Las disputas no resueltas en las relaciones personales pueden llevar a la violencia, ya sea en el hogar o en la comunidad.",
                "Creencias arraigadas, la presión de grupo y la influencia de la cultura pueden fomentar la violencia en algunas comunidades."
                ]
        }
        ,
        {
            "tag": "QueHacerVictimaViolencia",
            "patterns": ["Víctimas de violencia","Hago si soy victima de violencia","afectado de violencia"],
            "responses": [
                "Busca seguridad: Prioriza tu seguridad y busca un lugar seguro de inmediato. Habla con alguien de confianza , comunica tu situación a un amigo, familiar o profesional de la salud. Llama a la policía si estás en peligro, contacta a las autoridades para denunciar la violencia y buscar protección."
                ]
        }
        ,
        {
            "tag": "SeñalesVictimaViolencia",
            "patterns": ["como saber si soy victima de violencia","señales de violencia"],
            "responses": [
                "Esto puede implicar golpes, empujones, bofetadas o cualquier forma de contacto físico no consensuado que cause daño o miedo a la víctima.",
                "Las palabras pueden ser armas poderosas. Las amenazas, insultos, humillaciones y declaraciones intimidantes pueden ser señales de violencia verbal.",
                "se manifiesta a través de la manipulación, el control excesivo, la degradación y la invalidación de los sentimientos de la víctima, lo que puede causar daño psicológico."
                ]
        }
        ,

        {
            "tag": "QueEsExpresiónDeGenero",
            "patterns": ["Qué es expresión de género","Explicar expresión de género","Explicación de expresión de género","Descripción de expresión de género","Describir expresión de género","Significado de expresión de género","Concepto de expresión de género","Expresión de expresión de género","expresión de género"],
            "responses": [
                "La expresión de género es cómo una persona muestra su identidad a través de comportamientos y apariencia, que pueden ser conformes o no conformes a las expectativas sociales de género.",
                "Es la forma en que alguien se presenta al mundo, incluyendo la ropa, el peinado y el comportamiento, reflejando su identidad de género interna.",
                "La expresión de género es la manera en que una persona comunica su identidad a través de su apariencia y comportamiento, pudiendo ser tradicional o divergente respecto a las normas de género establecidas."
            ]
        },
        {
            "tag": "QuiénMuestraLaExpresiónDeGenero",
            "patterns": ["Quién muestra la expresión de género", "Explícame en detalle quién muestra la expresión de género","personas que muestran la expresión de género"],
            "responses": [
                "Todas las personas, independientemente de su identidad de género, muestran expresión de género a través de su apariencia y comportamiento.",
                "La expresión de género es una característica común a todas las personas, no limitada a un grupo específico.",
                "Cada individuo tiene su propia forma única de expresar su género, independientemente de su identidad de género, a través de su comportamiento y apariencia."
            ]
        },
        {
            "tag": "CómoSeManifiestaLaExpresiónDeGenero",
            "patterns": ["Cómo se manifiesta la expresión de género", "Explícame Cómo se manifiesta la expresión de género","De qué forma se manifiesta la expresión de género"],
            "responses": [
                "La expresión de género se manifiesta a través de la forma de vestir, el comportamiento y las interacciones sociales de una persona.",
                "Se refleja en la elección de ropa, gestos y roles que una persona adopta, mostrando su identidad de género.",
                "La expresión de género se ve en la apariencia, comportamiento y relaciones de una persona, indicando cómo se identifican internamente en términos de género."
            ]
        },
        {
            "tag": "PorquéSeDaLaExpresiónDeGenero",
            "patterns": ["Porque se da la expresión de género", "Explícame porque se da la expresión de género","porqué surge la expresión de género"],
            "responses": [
                "Las expresiones de género surgen de la diversidad natural de las personas y cómo cada individuo se relaciona con las expectativas sociales de género.",
                "Están influenciadas por factores biológicos, sociales y culturales, lo que lleva a una amplia variedad de identidades y formas de expresar el género.",
                "Cada persona es única, lo que resulta en una diversidad de expresiones de género, ya que cada individuo interpreta y vive su identidad de género de manera diferente."
            ]
        },
        {
            "tag": "QuéEsViolenciaFisica",
            "patterns": ["Que es la violencia fisica","Explicar violencia fisica","Explicación de violencia fisica","Descripción de violencia fisica","Describir violencia fisica","Significado de violencia fisica","Concepto de violencia fisica","Expresión de violencia fisica","violencia fisica"],
            "responses": [
                "La violencia física puede ser el resultado de una combinación de factores individuales, sociales y emocionales, incluidos conflictos personales, abuso de sustancias, problemas de salud mental, presión de grupo y desigualdad social.",
                "La violencia física es la acción de herir o lastimar a alguien mediante el uso de la fuerza física, como golpes, patadas o puñetazos.",
                "La violencia física implica cualquier acto en el que una persona inflige daño físico a otra a través de acciones como agresiones físicas, asaltos o cualquier forma de violencia que tenga un componente físico evidente"    
            ]
        },
        {
            "tag": "CuálesSonLosSignosDeViolenciaFísica",
            "patterns": ["Cuáles son los signos físicos de la violencia física","Háblame sobre los signos de violencia física","Explícame los signos de violencia física"],
            "responses": [
                "Los signos de violencia física incluyen lesiones inexplicables, dolor persistente y cambios emocionales.",
                "Los signos de violencia física incluyen lesiones inexplicables, dolor persistente y cambios emocionales como miedo o evitación del contacto físico.",
                "Los signos de violencia física incluyen lesiones visibles, dolor persistente, dificultades para moverse y cambios emocionales como miedo o evitación del contacto físico. "    
            ]
        },
        {
            "tag": "DóndeSeDaLaViolenciaFísica",
            "patterns": ["En qué lugares se da la violencia física","Explícame los entornos donde ocurre la violencia física","Dónde se da la violencia física"],
            "responses": [
                "La violencia física se manifiesta en diversos contextos, incluyendo relaciones familiares y de pareja, conflictos escolares y peleas comunitarias. También ocurre en instituciones y puede dirigirse hacia niños o incluso ser autodirigida.",
                "Los tipos de violencia física abarcan agresiones en el hogar, parejas íntimas, escuelas y comunidades. Además, se observa en instituciones y puede afectar a niños y adultos. Incluso las autolesiones son consideradas una forma de violencia física.",
                "La violencia física se presenta en diferentes ámbitos, como el hogar, relaciones románticas, escuelas y espacios públicos."    
            ]
        },
        {
            "tag": "RecursosDeApoyoDeViolenciaFísica",
            "patterns": ["Existen recursos de apoyo para las personas que han sido víctimas de violencia física"],
            "responses": [
                "sin respuesta"  
            ]
        },

        {
            "tag": "CuálesSonLasCausasDeViolenciaFísica",
            "patterns": ["Cuáles son las causas más comunes de la violencia física","Cuáles son las principales causas de la violencia física","Causas de Violencia física"],
            "responses": [
                "La violencia física puede originarse por desigualdades económicas, discriminación, problemas de salud mental y normas culturales que toleran la agresión. También puede surgir de experiencias traumáticas en la infancia y entornos violentos.",
                "La violencia física tiene raíces en desigualdades sociales, discriminación y falta de acceso a recursos. Factores como problemas de salud mental y exposición a la violencia en la infancia también contribuyen a su aparición.",
                "La violencia física se origina en factores complejos como desigualdades económicas, discriminación y normas culturales tolerantes hacia la agresión. Problemas de salud mental, historiales de abuso y entornos violentos también están implicados en su aparición."
            ]
        },
        {
            "tag": "CuálesSonLasConsecuenciasDeViolenciaFísica",
            "patterns": ["Cuáles son las consecuencias de la violencia física","Háblame sobre las consecuencias de la violencia física","Consecuencias fisicas"],
            "responses": [
                "La violencia física puede contribuir a la perpetuación de ciclos de violencia en la sociedad y causar daños mentales y emocionales  a largo plazo tanto a las víctimas como a los perpetradores.",
                "La violencia física conlleva graves consecuencias para todas las partes involucradas. Esto incluye lesiones físicas, trauma emocional, deterioro de relaciones, posibles problemas legales, costos financieros, efectos negativos en los niños testigos, y una contribución a la perpetuación de ciclos de violencia en la sociedad.",
                "La violencia física tiene ramificaciones significativas. Puede causar daños físicos directos, así como un dolor emocional profundo en las víctimas. Esto puede llevar a la ruptura de relaciones y, en algunos casos, a un ciclo continuo de abuso."
            ]
        },
        {
            "tag": "desconocido",
            "patterns": ["*"],
            "responses": [
                "Lo siento, no te entiendo. ¿Podrías preguntar algo relacionado con la violencia basada en género?",
                "Parece que estoy un poco confundido con eso.¿Podrías preguntar algo relacionado con la violencia basada en género?",
                "No estoy seguro de entender. ¿Podrías proporcionar más detalles o hablar algo relacionado con violencia basada en género ?",
                "Mis conocimientos son limitados y puede que no pueda ayudarte con eso en particular."
                
            ]
        }

        

        
        
        
    
    ]
}